Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/advanced-configuration.po
Languages: cs_cz, ko_kr, pt_br

source: Advanced configuration
cs_cz: Pokročilé nastavení
ko_kr: 고급 구성
pt_br: Configuração avançada

source: SSL connection to database
cs_cz: SSL připojení k databázi
ko_kr: 데이터베이스로 SSL 연결
pt_br: Conexão SSL ao banco de dados

source: Once installation is done, you can update the ``config/config_db.php`` to define SSL connection parameters. Available parameters corresponds to parameters used by `mysqli::ssl_set() <https://www.php.net/manual/en/mysqli.ssl-set.php>`_:
cs_cz: Po dokončení instalace můžete aktualizovat `` config / config_db.php`` a definovat parametry připojení SSL. Dostupné parametry odpovídají parametrům používaným programem `mysqli :: ssl_set () <https://www.php.net/manual/en/mysqli.ssl-set.php>` _:
ko_kr: 설치가 완료되면, SSL 연결 매개변수를 정의하기 위해 ``config/config_db.php``를 업데이트 할 수 있습니다. 사용가능한 매개변수는 `mysqli::ssl_set() <https://www.php.net/manual/en/mysqli.ssl-set.php>`_에서 사용되는 매개변수에 해당됩니다:
pt_br: Depois que a instalação estiver concluída, você poderá atualizar o ``config/config_db.php`` para definir os parâmetros de conexão SSL. Os parâmetros disponíveis correspondem aos parâmetros usados por `mysqli :: ssl_set () <https://www.php.net/manual/en/mysqli.ssl-set.php>`_:

source: ``$dbssl`` defines if connection should use SSL (`false` per default)
cs_cz: `` $ dbssl`` definuje, zda by připojení mělo používat SSL (ve výchozím nastavení je na hodnotě `false ')
ko_kr: ``$dbssl`` 연결이 SSL을 사용해야 하는지를 정의 (기본값은 `false`)
pt_br: ``$ dbssl`` define se a conexão deve usar SSL (`false` por padrão)

source: ``$dbsslkey`` path name to the key file (`null` per default)
cs_cz: `` $ dbsslkey`` název cesty k souboru klíče (ve výchozím nastavení není definováno `null`)
ko_kr: ``$dbsslkey`` 키 파일의 경로 명 (기본으로 `null`)
pt_br: ``$dbsslkey`` nome do caminho para o arquivo de chave (`null` por padrão)

source: ``$dbsslcert`` path name to the certificate file (`null` per default)
cs_cz: `` $ dbsslcert`` název cesty k souboru certifikátu (ve výchozím nastavení není definován `null`)
ko_kr: ``$dbsslcert`` 인증 파일의 경로 명 (기본으로 `null`)
pt_br: ``$dbsslcert`` nome do caminho para o arquivo de certificado (`null` por padrão)

source: ``$dbsslca`` path name to the certificate authority file (`null` per default)
cs_cz: `` $ dbsslca`` název cesty k souboru certifikační autority (ve výchozím nastavení není definován `null`)
ko_kr: ``$dbsslca`` 인증 기관 파일의 경로 명 (기본으로 `null`)
pt_br: ``$dbsslca`` Nome do caminho para o arquivo de autoridade de certificação (`null` por padrão)

source: ``$dbsslcapath`` pathname to a directory that contains trusted SSL CA certificates in PEM format (`null` per default)
cs_cz: `` $ dbsslcapath`` cesta k adresáři, který obsahuje důvěryhodné certifikáty SSL CA ve formátu PEM (ve výchozím nastavení není definována `null`)
ko_kr: ``$dbsslcapath`` PEM 형식의 신뢰하는 SSL CA 인증서가 포함된 디렉토리 경로명 (기본으로 `null`)
pt_br: ``$dbsslcapath`` nome do caminho para um diretório que contém certificados CA SSL confiáveis no formato PEM (`null` por padrão)

source: ``$dbsslcacipher`` list of allowable ciphers to use for SSL encryption (`null` per default)
cs_cz: ``$dbsslcacipher`` seznam povolených šifer pro šifrování SSL (ve výchozím nastavení není definován `null`)
ko_kr: ``$dbsslcacipher`` SSL 암호화에 사용될 수 있는 암호화 목록 (기본으로 `null`)
pt_br: ``$dbsslcacipher`` lista de cifras permitidas para criptografia SSL (`null` por padrão)

source: For now it is not possible to define SSL connection parameters prior or during the installation process. It has to be done once installation has been done.
cs_cz: Prozatím není možné definovat parametry připojení SSL před nebo během procesu instalace. Nastavení parametrů SSL připojení musí být provedeno až po dokončení instalace.
ko_kr: 현재 설치 진행 이전이나 설치 중에 SSL 연결 매개변수를 정의할 수 없습니다. 설치가 완료되고 해야합니다.
pt_br: Por enquanto, não é possível definir parâmetros de conexão SSL antes ou durante o processo de instalação. Isso deve ser feito assim que a instalação for concluída.
