Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/index.po
Languages: cs_cz, es_419, fr_fr, pt_br, zh_cn

source: An extra step would be to secure (or remove) installation directory. As an example, you can consider adding the following to your Apache virtual host configuration (or in the ``glpi/install/.htaccess`` file):
cs_cz: Dalším krokem by bylo zabezpečení (nebo odebrání) instalační složky. Například můžete zvážit přidání následujícího do svého nastavení Apache virtuálního hostitele (nebo do souboru ``glpi/install/.htaccess``):
es_419: Un paso adicional sería asegurar (o eliminar) el directorio de instalación. Como ejemplo, puede considerar agregar lo siguiente a su configuración de host virtual de Apache (o en el archivo `` glpi/install/.htaccess``):
fr_fr: Une étape supplémentaire serait de sécuriser (ou de supprimer) le répertoire d'installation. Par exemple, vous pouvez envisager d'ajouter la configuration suivante à votre hôte virtuel Apache (ou dans le fichier ``glpi/install/.htaccess``) :
pt_br: Uma etapa extra seria proteger (ou remover) o diretório de instalação. Como exemplo, você pode adicionar o seguinte à configuração do host virtual do Apache ou no ficheiro ``glpi/install/.htaccess``
zh_cn: 额外的步骤是保护（或删除）安装目录。例如，您可以考虑将以下内容添加到Apache虚拟主机配置（或“glpi/install/.htaccess``文件中）：

source: With this example, the `install` directory access will be limited to localhost only and will display an error message otherwise. Of course, you may have to adapt this to your needs; refer to your web server's documentation.
cs_cz: V této ukázce bude složka `install` přístupná pouze z počítače samotného a jinak zobrazí chybu. Samozřejmě si toto můžete přizpůsobit svým potřebám. Nahlédněte do dokumentace k webovému serveru, který používáte.
es_419: Con este ejemplo, el acceso al directorio `install` se limitará solo a localhost y, de lo contrario, mostrará un mensaje de error. Por supuesto, puede que tenga que adaptar esto a sus necesidades; Consulte la documentación de su servidor web.
fr_fr: Avec cet exemple, l'accès au dossier ``install`` serait limité au seul hôte local et afficherait un message sinon. Bien sûr, vous pouvez adapter cela à vos besoins, référez-vous à la documentation de votre serveur web.
pt_br: Neste exemplo, o acesso ao diretório `install` será limitado apenas ao localhost e exibirá uma mensagem de erro caso contrário. Obviamente, você pode ter que adaptar isso às suas necessidades; consulte a documentação do seu servidor web.
zh_cn: 在这个例子中，`install`目录访问将仅限于localhost，否则将显示错误消息。当然，您可能需要根据您的需要进行调整;

source: Installation
cs_cz: Instalace
es_419: Instalación
pt_br: Instalação
zh_cn: 安装

source: GLPI configuration will be stored in ``/etc/glpi``, just copy the ``config`` directory to this place. GLPI requires read rights on this directory to work; and write rights during the installation process.
pt_br: A configuração do GLPI será armazenada em `` /etc/glpi``, basta copiar o diretório `` config`` para este local. O GLPI requer direitos de leitura neste diretório para funcionar; e direitos de gravação durante o processo de instalação.
zh_cn: GLPI配置将存储在``/etc/glpi``中，只需将``config``目录复制到此处即可。GLPI需要此目录的读取权限；并在安装过程中需要写入权限。

source: GLPI data will be stored in ``/var/lib/glpi``, just copy the ``files`` directory to this place. GLPI requires read and write rights on this directory.
pt_br: Os dados GLPI serão armazenados em `` /var/lib/glpi``, basta copiar o diretório `` files`` para este local. O GLPI requer direitos de leitura e gravação neste diretório.
zh_cn: GLPI数据将存储在``/var/lib/glpi``中，只需将``files``目录复制到此处即可。GLPI需要对此目录具有读写权限。
