Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/index.po
Languages: cs_cz, es_419, fr_fr, pt_br, zh_cn

source: Install GLPI
cs_cz: Instalace GLPI
es_419: Instalar GLPI
fr_fr: Installer GLPI
pt_br: Instalar GLPI
zh_cn: 安装 GLPI

source: Proceed as follow:
cs_cz: Postupujte následovně:
es_419: Proceda como sigue:
fr_fr: Procéder comme suit :
pt_br: Proceda da seguinte forma:
zh_cn: 请按以下步骤操作：

source: Choose a version,
cs_cz: Zvolte verzi,
es_419: Elige una versión,
fr_fr: Choisir une version,
pt_br: Escolha uma versão,
zh_cn: 版本选择,

source: Download the archive,
cs_cz: Stáhněte si archiv,
es_419: Descarga el archivo,
fr_fr: Télécharger l'archive,
pt_br: Baixe o arquivo,
zh_cn: 下载档案，

source: Install :)
cs_cz: Nainstalujte :)
es_419: Instalar :)
fr_fr: Installer :)
pt_br: Instale :)
zh_cn: 安装 :)

source: Choose a version
cs_cz: Volba verze
es_419: Elige una versión
fr_fr: Choisir une version
pt_br: Escolha uma versão
zh_cn: 选择版本

source: It is hightly recommended you choose the latest stable release for a production usage.
cs_cz: Pro použití v produkčním prostředí je důrazně doporučeno používat nejnovější stabilní vydání.
es_419: Se recomienda encarecidamente que elija la última versión estable para un uso de producción.
fr_fr: Il est fortement recommandé de choisir la dernière version stable pour une utilisation en production.
pt_br: É altamente recomendável escolher a versão estável mais recente para um uso de produção.
zh_cn: 强烈建议您为生产用途选择最新的稳定版本。

source: GLPI follows a semantic versioning scheme, on 3 digits. The first one is the major release, the second the minor and the third the fix release.
cs_cz: GLPI používá významové schéma označování verzí, se třemi číslicemi. První je hlavní vydání, druhé dílčí a třetí opravné.
es_419: GLPI sigue un esquema de versionamiento semántico, en 3 dígitos. El primero es el lanzamiento principal, el segundo, el menor y el tercero, el lanzamiento de corrección.
fr_fr: GLPI suit une règle de versionnage sémantique, sur 3 chiffres. Le premier correspond à la version majeure, le second à la version mineure, le troisième à la version corrective.
pt_br: O GLPI segue um esquema de versão semântico em 3 dígitos. O primeiro é o lançamento principal, o segundo o menor e o terceiro a versão fixa.
zh_cn: GLPI遵循3位数的语义版本控制方案。第一个是主要版本，第二个是次要版本，第三个是修订版本。

source: Major releases may come with important incompatibilities as well as new features; minor versions may bring new features as well, but stay perfectly compatible inside a major version.
cs_cz: Hlavní vydání mohou přinášet nové funkce, ale z důvodu podstatných změn také vyhnutelné nekompatibility; to dílčí verze mohou přinášet spíše drobnější nové funkce, zato v rámci daného hlavního vydání zůstává kompatibilita zachována.
es_419: Las principales versiones pueden venir con importantes incompatibilidades así como nuevas características; Las versiones secundarias también pueden traer nuevas características, pero siguen siendo perfectamente compatibles dentro de una versión principal.
fr_fr: Les version majeures peuvent amener d'importantes incompatibilités ainsi que de nouvelles fonctionnalités ; les versions mineures quant à elles apportent également de nouvelles fonctionnalités mais restent parfaitement compatibles au sein d'une version majeure.
pt_br: Os principais lançamentos podem vir com incompatibilidades importantes, bem como com novos recursos; As versões menores também podem trazer novos recursos, mas mantêm-se perfeitamente compatíveis dentro de uma versão importante.
zh_cn: 主要版本可能具有重要的不兼容性和新功能；次要版本也可能带来新功能，但在主要版本内保持完美兼容。

source: Fixes releases will only fix reported issues without adding anything new.
cs_cz: Opravná vydání řeší pouze nahlášené problémy a nepřidávají nic nového.
es_419: Solucionar arreglos solo solucionará problemas reportados sin agregar nada nuevo.
fr_fr: Les versions correctives, quand à elles, se contentent de corriger les problèmes reportés sans ajout de fonctionnalités.
pt_br: As versões de correções só resolverão os problemas relatados sem adicionar nada novo.
zh_cn: 修复版本只会修复报告的问题而不添加任何新内容。

source: Download
cs_cz: Stažení
es_419: Descargar
fr_fr: Télécharger
zh_cn: 下载

source: On GitHub, there are always two archives named *Source code* which should not be used.
cs_cz: Na portálu GitHub jsou vždy ještě dva další archivy nazvané *Source code* (zdrojové kódy) – ty nepoužívejte.
es_419: En GitHub, siempre hay dos archivos con el nombre * Código fuente * que no deben utilizarse.
fr_fr: Sur GitHub, il existe systématiquement deux archives nommées *Source code* ; ces versions ne sont pas destinées à être téléchargées par les utilisateurs.
pt_br: No GitHub há sempre dois arquivos denominados * Código-fonte * que não devem ser usados.
zh_cn: 在GitHub上，总有两个名为*Source code*的档案，不应该使用。不应该这样说啊，github上不使用的source code好像没这说法。

source: Go to the *download* section of `the GLPI website <http://glpi-project.org>`_ (or get archive directly from `Github release <https://github.com/glpi-project/glpi/releases>`_) and choose the ``glpi-{version}.tgz`` archive.
cs_cz: Jděte do sekce *download* (stahování) `webových stránek GLPI <http://glpi-project.org>`_ (nebo získejte archiv přímo z `vydání na portálu Github <https://github.com/glpi-project/glpi/releases>`_) a zvolte archiv ``glpi-{verze}.tgz``.
es_419: Vaya a la sección * descargar * del `sitio web de GLPI <http://glpi-project.org>` _ (u obtenga el archivo directamente desde `Github release <https://github.com/glpi-project/glpi/releases > `_) y elija el archivo` `glpi- {versión} .tgz``.
fr_fr: Aller à la section *téléchargement* `du site web GLPI <http://glpi-project.org>`_ (ou obtenir l'archive directement depuis `les releases Github <https://github.com/glpi-project/glpi/releases>`_) et choisir l'archive ``glpi-{version}.tgz``.
pt_br: Vá para a seção *download* do site GLPI <http://glpi-project.org> `_ (ou obtenha o arquivo diretamente da versão 'Github' <https://github.com/glpi-project/glpi/releases > `_) e escolha o arquivo` `glpi- {version} .tgz``.
zh_cn: 点击 *下载* 按钮 `GLPI 官方网站 <http://glpi-project.org>`_ (或从Github获取 `Github release <https://github.com/glpi-project/glpi/releases>`_) 选择 ``glpi-{version}.tgz`` 文档.

source: Packages may be available from your Linux distribution (Red Hat, CentOS, Fedora, Ubuntu, ...) that you should use with your standard packages manager as usual.
cs_cz: Pro vámi používanou linuxovou distribuci (Red Hat, CentOS, Fedora, Ubuntu, atp.) mohou být k dispozici předpřipravené balíčky (otázkou je, jak aktuální), které nainstalujete pomocí správce balíčků.
es_419: Los paquetes pueden estar disponibles en su distribución de Linux (Red Hat, CentOS, Fedora, Ubuntu, ...) que debe usar con su administrador de paquetes estándar como de costumbre.
fr_fr: Il existe également de nombreux paquets pour les distributions (Red Hat, CentOS, Fedora, Ubuntu, …) qu'il est possible d'installer avec le gestionnaire de paquets habituel.
pt_br: Os pacotes podem estar disponíveis na sua distribuição (Red Hat, CentOS, Fedora, Ubuntu, etc) que você deve usar com seu gerenciador de pacotes padrão como de costume.
zh_cn: 可以从您的Linux发行版（Red Hat，CentOS，Fedora，Ubuntu，...）中获得软件包，您应该像往常一样使用标准软件包管理器。

source: GLPI installation itself is composed of three steps:
cs_cz: Instalace GLPI samotná se skládá ze tří kroků:
es_419: La instalación de GLPI se compone de tres pasos:
fr_fr: L’installation à proprement parler de GLPI est composée de trois étapes :
pt_br: A instalação GLPI em si é composta de três etapas:
zh_cn: GLPI安装由三个步骤组成：

source: Uncompress the archive in your website;
cs_cz: Rozbalení archivu do kořenové složky vašeho webu;
es_419: Descomprima el archivo en su sitio web;
fr_fr: Décompresser l’archive dans l’arborescence de votre serveur web ;
pt_br: Descompacte o arquivo em seu site;
zh_cn: 解压缩您网站中的存档；

source: Give your webserver write access to the ``files`` and ``config`` directories;
cs_cz: Udělení práv k zápisu do složek ``files`` a ``config`` vašemu webovému serveru:
es_419: Dé a su servidor web acceso de escritura a los directorios `` files`` y `` config``;
fr_fr: Donner les droits en écriture à votre serveur web sur les dossiers ``files`` et ``config`` ;
pt_br: Permita acesso para gravação nos diretórios `` files`` e `` config`` do seu servidor web;
zh_cn: 让你的web服务器写入``files``和``config``目录；

source: :doc:`launch installation wizard <wizard>` (or use the :ref:`command line installation script <cdline_install>`).
cs_cz: Spuštění :doc:`průvodce instalací <wizard>` (nebo použití :ref:`skriptu pro instalaci z příkazového řádku <cdline_install>`).
es_419: : doc: `inicie el asistente de instalación <wizard>` (o use la secuencia de comandos de instalación de la línea de comandos: ref: <cdline_install>``).
fr_fr: :doc:`lancer l'assistant d'installation <wizard>` (ou utiliser :ref:`le script d'installation en ligne de commande <cdline_install>`).
pt_br: :doc: `iniciar o assistente de instalação` (ou use: ref. `script de instalação na linha de comando').
zh_cn: ：doc：`启动安装向导<wizard>`（或使用：ref：`命令行安装脚本<cdline_install>`）。

source: Once these three steps have been completed the application is ready to be used.
cs_cz: Po dokončení těchto třech kroků je aplikace připravena k používání.
es_419: Una vez que se han completado estos tres pasos, la aplicación está lista para ser utilizada.
fr_fr: Une fois ces étapes effectuées l’application est prête à être utilisée.
pt_br: Uma vez que as três etapas foram concluídas o aplicativo está pronto para utilização.
zh_cn: 完成这三个步骤后，即可使用该应用程序。

source: If you need to set advanced configuration, like SSL connection parameters, please refer to :doc:`advanced configuration <advanced-configuration>`.
fr_fr: Si vous avez besoin de configuration avancée, comme la mise en place de paramètres de connexion SSL, référez-vous à :doc:`la configuration avancée <advanced-configuration>`.
pt_br: Caso precise de activar uma configuração avançada, por exemplo ligação via ssl, verificar :doc:`advanced configuration'.

source: Files and directories locations
cs_cz: Umístění souborů a složek
es_419: Ubicaciones de archivos y directorios
fr_fr: Emplacements des dossiers et fichiers
pt_br: Localizações de arquivos e diretórios
zh_cn: 文件和目录位置

source: Like many other web applications, GLPI can be installed by just copying the whole directory to any web server. However, this may be less secure.
cs_cz: Jako mnoho ostatních webových aplikací, GLPI je možné nainstalovat pouhým zkopírováním celé složky na libovolný webový server. Nicméně to může být méně zabezpečené.
es_419: Al igual que muchas otras aplicaciones web, GLPI se puede instalar simplemente copiando todo el directorio a cualquier servidor web. Sin embargo, esto puede ser menos seguro.
fr_fr: Comme beaucoup d’applications web, GLPI peut être installé en copiant simplement le contenu complet du répertoire sur un serveur web quelconque. Néanmoins, une telle pratique peut s’avérer relativement peu sécurisée.
pt_br: Como muitos outros aplicativos da Web, o GLPI pode ser instalado copiando todo o diretório para qualquer servidor web. Esta opção pode ser menos segura.
zh_cn: 和许多其他Web应用程序一样，只需将整个目录复制到任何Web服务器即可安装GLPI。但是，这可能不太安全

source: Every file accessible directly from a web server must be considered unsafe!
cs_cz: Každý soubor přístupný přímo z webového serveru je třeba považovat za nezabezpečený!
es_419: ¡Todos los archivos accesibles directamente desde un servidor web deben considerarse inseguros!
fr_fr: Tout fichier accessible directement depuis un serveur web doit être considéré comme non sécurisé !
pt_br: Todo arquivo acessível diretamente de um servidor web deve ser considerado inseguro!
zh_cn: 直接从Web服务器访问的每个文件都必须被视为不安全！

source: GLPI stores some data in the ``files`` directory, the database access configuration is stored in the ``config`` directory, etc. Even if GLPI provides some ways to prevent files from being accessed by the webserver directly, best practise is to store data outside of the web root. That way, sensitive files cannot be accessed directly from the web server.
cs_cz: GLPI uchovává některá data ve složce ``files``, přístupové údaje k databázi ve složce ``config``, atd. I když GLPI poskytuje některé způsoby jak zabránit, aby k souborům mohl webový server přímo přistupovat, nejlepší je uchovávat je mimo kořenovou složku webu. Tím nemůže být k souborům s citlivým obsahem přistupováno přímo prostřednictvím webového serveru.
es_419: GLPI almacena algunos datos en el directorio `` files``, la configuración de acceso a la base de datos se almacena en el directorio `` config``, etc. Incluso si GLPI proporciona algunas maneras de evitar que el servidor web acceda directamente a los archivos, la mejor práctica es para almacenar datos fuera de la raíz web. De esa manera, no se puede acceder a los archivos confidenciales directamente desde el servidor web.
fr_fr: GLPI stocke un certain nombre de données dans son répertoire ``files``, la configuration de votre base de données est stockée dans le dossier ``config``, … Bien que des dispositions soient prises pour éviter que des données sensibles puisse être rendues accessibles directement depuis un serveur web, la meilleure façon de les protéger reste de les stocker en dehors de la racine web. De cette manière, les fichiers sensibles ne seront pas accessibles directement depuis le serveur web.
pt_br: O GLPI armazena alguns dados no diretório `` files`` e a configuração de acesso ao banco de dados é armazenada no diretório `` config``. Mesmo que o GLPI forneça segurança para evitar que os arquivos sejam acessados diretamente de um servidor web, a melhor maneira é armazenar os dados fora da raiz da Web. Dessa forma, arquivos sensíveis não podem ser acessados diretamente do servidor web.
zh_cn: GLPI将一些数据存储在``files``目录中，数据库账号密码等访问配置信息都存储在``config``目录中，等等。即使GLPI提供了一些方法来防止Web服务器直接访问文件，最佳做法是将数据存储在Web根目录之外。 这样，无法直接从Web服务器访问敏感文件。

source: There are a few configuration directives you may use to achieve that (directives that are used in provided downstream packages):
cs_cz: Je k dispozici několik direktiv nastavení, kterými je toho možné docílit (direktivy které jsou použity v balíčcích, poskytovaných linuxovými distribucemi):
es_419: Hay algunas directivas de configuración que puede usar para lograr eso (directivas que se usan en los paquetes proporcionales proporcionados):
fr_fr: Un certain nombre de variables de configuration qu’il est possible d’utiliser pour ce faire (utilisées d’ailleurs dans les paquets fournis par les distributions linux) :
pt_br: Existem algumas diretivas de configuração que você pode usar para conseguir isso (diretivas usadas nos pacotes a jusante fornecidos):
zh_cn: 您可以使用一些配置指令来实现该指令（在提供的下游包中使用的指令）：

source: ``GLPI_CONFIG_DIR``: set path to the configuration directory;
cs_cz: ``GLPI_CONFIG_DIR``: nastavit popis umístění složky s nastaveními;
es_419: ``GLPI_CONFIG_DIR``: establece la ruta al directorio de configuración;
fr_fr: ``GLPI_CONFIG_DIR`` : définit le chemin d'accès du dossier de configuration ;
pt_br: `GLPI_CONFIG_DIR``: defina o caminho para o diretório de configuração;
zh_cn: ``GLPI_CONFIG_DIR``：设置配置目录的路径；

source: ``GLPI_VAR_DIR`` : set path to the ``files`` directory;
cs_cz: ``GLPI_VAR_DIR`` : nastavit popis umístění složky ``files``;
es_419: ``GLPI_VAR_DIR``: establece la ruta al directorio ``files``;
fr_fr: ``GLPI_VAR_DIR`` : définit le chemin d'accès du répertoire “fichiers” ;
pt_br: `` GLPI_VAR_DIR``: defina o caminho para o diretório `` files``;
zh_cn: ``GLPI_VAR_DIR`` : 设置 ``files`` 目录路径;

source: ``GLPI_LOG_DIR`` : set path to logs files.
cs_cz: ``GLPI_LOG_DIR``: nastavit popis umístění souborů pro záznam událostí (log).
es_419: ``GLPI_LOG_DIR``: establece la ruta a los archivos de registro.
fr_fr: ``GLPI_LOG_DIR`` : définit le chemin d'accès vers les fichiers de log.
pt_br: `` GLPI_LOG_DIR``: defina o caminho para os arquivos de log.
zh_cn: ``GLPI_LOG_DIR`` : 设置日志文件路径.

source: There are many other configuration directives available, the ones we talked about are the main to take into account for a more secure installation.
cs_cz: K dispozici je mnoho dalších direktiv nastavení, ty které zde byly zmíněny jsou hlavní, které mít na paměti pro lépe zabezpečenou instalaci.
es_419: Hay muchas otras directivas de configuración disponibles, de las que hemos hablado son las principales a tener en cuenta para una instalación más segura.
fr_fr: Il existe bien d’autres variables de configuration, celles évoquées ci-dessus sont les principales à prendre en considération pour une installation davantage sécurisée.
pt_br: Existem muitas outras diretrizes de configuração disponíveis, as mencionadas anteriormente são as principais para se levar em conta para ter uma instalação mais segura.
zh_cn: 还有许多其他配置指令可供使用，我们讨论的那些指令主要考虑更安全的安装。

source: Directories choice is entirely up to you; the following example will follow the `FHS <http://www.pathname.com/fhs/>`_ recommendations.
cs_cz: Volba složek je zcela na vás. Následující příklad dodržuje doporučení standardu `FHS <http://www.pathname.com/fhs/>`_ .
es_419: La elección de directorios depende completamente de usted; El siguiente ejemplo seguirá las recomendaciones `FHS <http://www.pathname.com/fhs/>` _.
fr_fr: Le choix des différents dossiers est laissé à votre entière appréciation ; l’exemple qui suit se base quand à lui sur les recommandations `FHS <http://www.pathname.com/fhs/>`.
pt_br: A escolha de diretórios depende inteiramente de você, o seguinte exemplo segue as recomendações `FHS <http://www.nomedocaminho.com/fhs/>`_.
zh_cn: 目录的选择完全取决于你；以下示例将遵循`FHS <http://www.pathname.com/fhs/>`_建议。

source: Our GLPI instance will be installed in ``/var/www/glpi``, a specific virtual host in the web server configuration will reflect this path.
cs_cz: Uváděná GLPI instance bude nainstalována do ``/var/www/glpi`` a pro toto umístění bude webovém serveru nastaven virtuální hostitel.
es_419: Nuestra instancia de GLPI se instalará en ``/var/www/glpi``, un host virtual específico en la configuración del servidor web reflejará esta ruta.
fr_fr: Notre instance de GLPI sera installée dans le dossier ``/var/www/glpi``, un hôte virtuel dans la configuration du serveur web reflètera ce chemin.
pt_br: O GLPI vai ser instalado no diretório `` /var/www/glpi``, um host virtual específico na configuração do servidor web irá refletir esse caminho.
zh_cn: 我们的GLPI实例将安装在``/var/www/glpi``中，Web服务器配置中的特定虚拟主机将反映此路径。

source: GLPI configuration will be stored in ``/etc/glpi``, just copy the contents of the ``config`` directory to this place. GLPI requires read rights on this directory to work; and write rights during the installation process.
fr_fr: La configuration de GLPI sera stockée dans ``/etc/glpi/``, copier simplement le contenu du dossier ``config`` à cet endroit. GLPI requiert un accès en lecture sur ce dossier pour fonctionner, et un accès en écriture lors de l'installation.

source: GLPI data will be stored in ``/var/lib/glpi``, just copy the contents of the ``files`` directory to this place. GLPI requires read and write rights on this directory.
fr_fr: Les données de GLPI seront stockées dans ``/var/lib/glpi/``, copier le contenu du dossier ``files`` à cet endroit. GLPI requiert les droits en lecture et écriture sur ce dossier.

source: GLPI logs files will be stored in ``/var/log/glpi``, there is nothing to copy here, just create the directory. GLPI requires read and write access on this directory.
cs_cz: Záznamy události (log) v GLPI budou ukládány do ``/var/log/glpi``. Není co kopírovat – stačí jen tuto složku vytvořit. GLPI potřebuje práva na čtení a zápis do této složky.
es_419: Los archivos de registro GLPI se almacenarán en ``/var/log/glpi``, no hay nada que copiar aquí, solo cree el directorio. GLPI requiere acceso de lectura y escritura en este directorio.
fr_fr: Les fichiers de log de GLPI seront stockés dans ``/var/log/glpi/``, il n’y a rien à copier. GLPI requiert les droits en lecture et écriture sur ce dossier.
pt_br: Os arquivos de log do GLPI serão armazenados em `` /var/log/glpi``, não há nada para copiar aqui, basta criar o diretório. O GLPI requer acesso de leitura e gravação neste diretório.
zh_cn: GLPI日志文件将存储在``/var/log/glpi``中，此处无需复制，只需创建目录即可。GLPI需要对此目录进行读写访问。

source: Following this instructions, we'll create a ``inc/downstream.php`` file into GLPI directory with the following contents:
cs_cz: Dle těchto pokynů, vytvoříme ve složce GLPI soubor ``inc/downstream.php`` s následujícím obsahem:
es_419: Siguiendo estas instrucciones, crearemos un archivo ``inc/downstream.php`` en el directorio GLPI con el siguiente contenido:
fr_fr: Suivant cette nomenclature, il convient de créer un fichier ``inc/downstream.php`` dans le dossier de GLPI avec le contenu suivant :
pt_br: Seguindo estas instruções, criaremos um arquivo `` inc/downstream.php`` no diretório GLPI com os seguintes conteúdos:
zh_cn: 按照这些说明，我们将在GLPI目录中创建一个``inc/downstream.php``文件，其中包含以下内容：

source: GLPI packages will certainly provide a ``inc/downstream.php`` file. This one must not be edited!
cs_cz: Balíčky s GLPI v rámci linuxové distribuce určitě poskytnou soubor ``inc/downstream.php`` – neupravujte ho!
es_419: Los paquetes GLPI proporcionarán un archivo `` inc / downstream.php``. ¡Este no debe ser editado!
fr_fr: Les paquets GLPI des différents dépôts fourniront très certainement un fichier ``inc/downstream.php``. Ce dernier ne doit pas être modifié !
pt_br: Os pacotes do GLPI certamente fornecerão um arquivo `` inc/downstream.php``. Este arquivo não deve ser editado!
zh_cn: GLPI包肯定会提供一个``inc/downstream.php``文件。这个不能编辑！

source: GLPI looks for a `local_define.php` file in its own `config` directory. If you want to use one form new config directory, you have to load it.
fr_fr: GLPI cherche un fichier `local_define.php` dans son propre dossier `config`. Si vous souhaitez en utiliser un depuis un autre dossier, vous devez le charger.
pt_br: O GLPI procura um arquivo `local_define.php` em seu próprio diretório` config`. Se você deseja usar um novo diretório de configuração, é necessário carregá-lo.

source: Then, create a file in ``/etc/glpi/local_define.php`` with the following contents:
cs_cz: Pak vytvoříme soubor ``/etc/glpi/local_define.php`` s následujícím obsahem:
es_419: Luego, crea un archivo en ``/etc/glpi/local_define.php`` con el siguiente contenido:
fr_fr: Ensuite, créer un fichier ``/etc/glpi/local_define.php`` avec le contenu suivant :
pt_br: Em seguida, crie um arquivo em ``/etc/glpi/local_define.php`` com os seguintes conteúdos:
zh_cn: 然后，使用以下内容在`/etc/glpi/local_define.php``中创建一个文件：

source: For GLPI prior to 9.2.2, the ``GLPI_VAR_DIR`` constant did not exist and it was required to set all paths separately:
cs_cz: V GLPI před verzí 9.2.2 neexistovala proměnná ``GLPI_VAR_DIR`` a bylo třeba nastavovat všechny popisy umístění zvlášť:
es_419: Para GLPI anterior a 9.2.2, la constante `` GLPI_VAR_DIR`` no existía y fue necesario establecer todas las rutas por separado:
fr_fr: Pour les versions de GLPI antérieures à 9.2.2, la constante ``GLPI_VAR_DIR`` n’existait pas. Il fallait donc redéfinir tous les chemins un par un :
pt_br: Para as versões do GLPI anteriores à 9.2.2, a constante ``GLPI_VAR_DIR`` não existe. Era necessário definir todos os caminhos separadamente:
zh_cn: 对于9.2.2之前的GLPI，``GLPI_VAR_DIR``常量不存在，需要分别设置所有路径：

source: Post installation
cs_cz: Po instalaci
es_419: Posterior a la instalación
fr_fr: Après installation
pt_br: Fim da instalação
zh_cn: 安装后

source: Once GLPI has been installed, you're almost done.
cs_cz: Poté, co je GLPI nainstalované, je téměř hotovo.
es_419: Una vez que se ha instalado GLPI, ya está casi listo.
fr_fr: Une fois GLPI installé, vous avez presque terminé.
pt_br: Uma vez instalado o GLPI, está quase terminado.
zh_cn: 一旦安装了GLPI，你就快完成了。
