Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/wizard.po
Languages: es_419, pt_br, zh_cn

source: Install wizard
es_419: Asistente de instalación
pt_br: Assistente de Instalação
zh_cn: 安装向导

source: To begin installation process, point your browser to the GLPI main address: `https://{adresse_glpi}/ <https://{adresse_glpi}/>`_
es_419: Para comenzar el proceso de instalación, dirija su navegador a la dirección principal de GLPI: `https://{adresse_glpi}/ <https://{adresse_glpi}/>` _
pt_br: Para iniciar o processo de instalação, aponte seu navegador para o endereço principal do GLPI: `https://{adresse_glpi}/<https://{adresse_glpi} />`_
zh_cn: 正式开始安装, 浏览器地址栏敲入 GLPI 地址: `https://{adresse_glpi}/ <https://{adresse_glpi}/>`_

source: When GLPI is not installed; a step-by-step installation process begins.
es_419: Cuando GLPI no está instalado; comienza un proceso de instalación paso a paso.
pt_br: Quando o GLPI não está instalado; um processo passo-a-passo de instalação iniciará.
zh_cn: 如GLPI尚未安装过，则您下一步下一步即可安装好的。

source: Choose lang (Select your language)
es_419: Elija un lenguaje (Seleccione su idioma)
pt_br: Selecione seu idioma
zh_cn: 选择语言 (请选择您的语言)

source: The first step will let you choose the installation language. Select your lang, and click validate.
es_419: El primer paso te permitirá elegir el idioma de instalación. Seleccione su idioma y haga clic en validar.
pt_br: O primeiro passo permitirá que você escolha o idioma de instalação. Selecione seu idioma e clique em validar.
zh_cn: 第一步将允许您选择安装语言。选择您的lang语言，并单击validate 生效。

source: License
es_419: Licencia
pt_br: Licença
zh_cn: 授权

source: Usage of GLPI is subject to GNU license approval. Once licensing terms read and accepted, just validate the form.
es_419: El uso de GLPI está sujeto a la aprobación de la licencia GNU. Una vez leídos y aceptados los términos de la licencia, simplemente valide el formulario.
pt_br: O uso do GLPI está sujeito à aprovação da licença GNU. Uma vez que os termos de licenciamento sejam lidos e aceitos, basta validar o formulário.
zh_cn: GLPI的使用需要GNU许可证的批准。一旦许可条款被阅读和接受，只需验证表单。

source: If you do not agree with licensing terms, it is not possible to continue installation process.
es_419: Si no está de acuerdo con los términos de la licencia, no es posible continuar el proceso de instalación.
pt_br: Se você não concordar com termos de licenciamento, não é possível continuar o processo de instalação.
zh_cn: 如果您不同意许可条款，则不可能继续安装过程。

source: Install / Update
es_419: Instalación / Actualización
pt_br: Instalar / Atualizar
zh_cn: 安装 / 升级

source: This screen allows to choose between a fresh GLPI installation or an update.
es_419: Esta pantalla permite elegir entre una nueva instalación de GLPI o una actualización.
pt_br: Esta tela permite escolher entre uma nova instalação GLPI ou uma atualização.
zh_cn: 本页面将允许在新的GLPI安装和更新之间进行选择。

source: Click on install.
es_419: Haga clic en instalar.
pt_br: Clique em instalar.
zh_cn: 点击安装.

source: Environment checks
es_419: Controles del entorno
pt_br: Verificações de ambiente
zh_cn: 环境检查

source: This step will check if prerequisites are met. If they're not, it is not possible to continue and an explicit error message will tell you about what is wrong and what to do before trying again.
pt_br: Esta etapa verificará se os pré-requisitos foram atendidos. Caso contrário, não é possível continuar e uma mensagem de erro explícita informará o que está errado e o que fazer antes de tentar novamente.

source: Some prerequisites are optionals, it will be possible to continue installation event if they're not met.
pt_br: Alguns pré-requisitos são opcionais, será possível continuar o evento de instalação se eles não forem atendidos.

source: Database connection
es_419: Conexión de base de datos
pt_br: Conexão de banco de dados
zh_cn: 连接数据库

source: Database connection parameters are asked.
es_419: Se piden parámetros de conexión a la base de datos.
pt_br: Os parâmetros de conexão do banco de dados são solicitados.
zh_cn: 询问数据库连接参数。

source: *MySQL server*: enter the path to your MySQL server, `localhost` or `mysql.domaine.tld` as example;
es_419: *MySQL server*: ingrese la ruta a su servidor MySQL, `localhost` o` mysql.domaine.tld` como ejemplo;
pt_br: *Servidor MySQL*: digite o caminho para o servidor MySQL, `localhost` ou` mysql.domain.tld` como exemplo;
zh_cn: * MySQL服务器*：输入MySQL服务器的路径，例如`localhost`或`mysql.domaine.tld`；

source: *MySQL user*: enter user name that is allowed to connect to the Database;
es_419: *MySQL user*: ingrese el nombre de usuario que tiene permitido conectarse a la base de datos;
pt_br: *Usuário MySQL*: digite o nome do usuário que está autorizado a se conectar ao banco de dados;
zh_cn: * MySQL用户*：输入允许连接数据库的用户名；

source: *MySQL password*: enter user's password.
es_419: *MySQL password*: introduzca la contraseña del usuario.
pt_br: *Senha MySQL*: digite a senha do usuário.
zh_cn: * MySQL密码*：输入用户密码。

source: Once all fields are properly filled, validate the form.
es_419: Una vez que todos los campos están correctamente rellenados, validar el formulario.
pt_br: Uma vez que todos os campos estiverem devidamente preenchidos, valide o formulário.
zh_cn: 正确填写所有字段后，验证格式。

source: A first database connection is then established. If parameters are invalid, an error message will be displayed, and you'll have to fix parameters and try again.
es_419: Luego se establece una primera conexión de base de datos. Si los parámetros no son válidos, se mostrará un mensaje de error, y tendrá que corregir los parámetros y volver a intentarlo.
pt_br: Uma primeira conexão de banco de dados é então estabelecida. Se os parâmetros forem inválidos, uma mensagem de erro será exibida, e você terá que consertar os parâmetros e tentar novamente.
zh_cn: 然后建立第一个数据库连接。如果参数无效，将显示错误消息，您必须修复参数并重试。

source: Database choice
es_419: Elección de base de datos
pt_br: Escolha do banco de dados
zh_cn: 选择数据库

source: Once connection to the database server is OK, you have to create or choose the database you want for your GLPI and init it.
es_419: Una vez que la conexión con el servidor de la base de datos sea correcta, debe crear o elegir la base de datos que desea para su GLPI e iniciarla.
pt_br: Uma vez que a conexão com o servidor do banco de dados está OK, você deve criar ou escolher o banco de dados que deseja para o GLPI e iniciar ele.
zh_cn: 与数据库服务器连接正常后，您必须为GLPI创建或选择所需的数据库并进行初始化。

source: There are 2 ways to go:
es_419: Hay 2 maneras de ir:
pt_br: Existem 2 maneiras de seguir:
zh_cn: 有两种方法：

source: use an existing database
es_419: utilizar una base de datos existente
pt_br: usar um banco de dados existente
zh_cn: 使用已有数据库

source: Select this database in the displayed list. Validate to use.
es_419: Seleccione esta base de datos en la lista mostrada. Validar para utilizar.
pt_br: Selecione este banco de dados na lista exibida. Validar para usar.
zh_cn: 在显示的列表中选择此数据库。验证使用。

source: Selected database contents will be destroyed on installation.
es_419: Los contenidos seleccionados de la base de datos serán destruidos en la instalación.
pt_br: O conteúdo selecionado do banco de dados será destruído na instalação.
zh_cn: 选定的数据库内容将在安装时销毁。

source: Create a new database
es_419: Crear una nueva base de datos
pt_br: Criar um novo banco de dados
zh_cn: 新建数据库

source: Choose *Create a new database*, enter the database name in the relevant field and then validate to create the base.
es_419: Elija *Crear una nueva base de datos*, ingrese el nombre de la base de datos en el campo relevante y luego valide para crear la base.
pt_br: Escolha *Criar um novo banco de dados*, digite o nome do banco de dados no campo relevante e depois valide para criar a base.
zh_cn: 选择*创建新数据库*，在相关字段中输入数据库名称，然后验证以创建基础。

source: SQL user must be able to create new database for this option to work.
es_419: El usuario de SQL debe poder crear una nueva base de datos para que esta opción funcione.
pt_br: O usuário SQL deve ser capaz de criar um novo banco de dados para que esta opção funcione.
zh_cn: SQL用户必须能够为此选项创建新数据库才能工作。

source: Database initialization
es_419: Inicialización de la base de datos
pt_br: Inicialização do banco de dados
zh_cn: 数据库初始化

source: This step initializes the database with default values.
es_419: Este paso inicializa la base de datos con valores por defecto.
pt_br: Esta etapa inicializa o banco de dados com valores padrões
zh_cn: 此步骤使用默认值初始化数据库。

source: If there is any error; pay attention to the displayed informations.
es_419: Si hay algún error; Preste atención a la información mostrada.
pt_br: Se houver algum erro, preste atenção nas informações exibidas.
zh_cn: 如果有任何错误；注意显示的信息。

source: Telemetry informations
es_419: Información de telemetría
pt_br: Informação de telemetria
zh_cn: 遥测信息

source: GLPI will ask you to share some Telemetry informations and to register. This is not mandatory.
es_419: GLPI le pedirá que comparta algunas informaciones de telemetría y que se registre. Esto no es obligatorio.
pt_br: O GLPI pedirá que você compartilhe algumas informações de telemetria e se registre. Isso não é obrigatório.
zh_cn: GLPI将要求您分享一些遥测信息并进行注册。这不是强制性的。

source: End of installation
es_419: Fin de la instalación
pt_br: Fim da instalação
zh_cn: 安装结束

source: This step presents a summary of the installation and give created users list. Please pay attention to those informations and validate to go to the app.
es_419: Este paso presenta un resumen de la instalación y proporciona una lista de usuarios creados. Preste atención a esas informaciones y valide para ir a la aplicación.
pt_br: Esta etapa apresenta um resumo da instalação e fornece uma lista de usuários criados. Preste atenção a essas informações e valide para ir ao aplicativo.
zh_cn: 此步骤提供安装摘要并提供所创建的用户列表。请记下此重要信息其将在登陆时需要用到。

source: Default user accounts are:
es_419: Las cuentas de usuario predeterminadas son:
pt_br: As contas de usuário padrão são:
zh_cn: 默认用户帐号是：

source: *glpi/glpi* admin account,
es_419: *glpi/glpi* cuenta de administrador,
pt_br: *glpi/glpi* conta de administrador,
zh_cn: *glpi/glpi* 为admin 管理员账号,

source: *tech/tech* technical account,
es_419: *tech/tech* cuenta para técnicos,
pt_br: *tech/tech* conta de técnico,
zh_cn: *tech/tech* 技术员账号,

source: *normal/normal* "normal" account,
es_419: *normal/normal* cuenta "normal" ,
pt_br: *normal/normal* conta "normal",
zh_cn: *normal/normal* "普通" 账号,

source: *post-only/postonly* post-only account.
es_419: *post-only/postonly* cuenta solo para postear .
pt_br: *post-only/postonly* conta somente pós-publicação.
zh_cn: *post-only/postonly* 作业员账号.

source: For obvious security concerns, you'll have to delete or edit those accounts.
es_419: Por razones obvias de seguridad, tendrá que eliminar o editar esas cuentas.
pt_br: Por razões de segurança, é aconselhável excluir ou editar essas contas.
zh_cn: 出于明显的安全问题，您必须删除或编辑这些帐户。

source: Before removing the ``glpi`` account, please make sure you have created another user with ``super-admin`` profile.
es_419: Antes de eliminar la cuenta ``glpi``, asegúrese de haber creado otro usuario con el perfil ``super-admin``.
pt_br: Antes de remover a conta ``glpi``, verifique se você criou outro usuário com o perfil ``super-admin``.
zh_cn: 在删除``glpi``帐户之前，请确保您使用``super-admin``配置文件创建了另一个用户。
