Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/command-line.po
Languages: fr_fr, ko_kr

source: Domains in GLPI have evolved from a simple dropdown to a more complex object, including records management among others. Therefore, the Domains plugins feature are now included in core.
fr_fr: Dans GLPI, les domaines ont évolué pour passer d'un simple intitulé à un objet plus complexe, incluant, entre autres, la gestion des enregistrements de noms. Ainsi, les fonctionnalités du plugin Domaines sont maintenant présentes dans le cœur de GLPI.
ko_kr: GLPI 의 도메인은 단순한 드롭다운에서 객체들 간의 레코드 관리를 포함하는, 더 복합적인 객체로 발전되었습니다. 따라서, 도메인 플러그인 기능은 이제는 코어에 포함되었습니다.

source: To migrate your plugin data; use the ``glpi:migration:domains_plugin_to_core`` command. Presence of the plugin is mandatory so checks can be run, you can use the ``--without-plugin`` switch but this is not recommended. If you were using an older version of the plugin than the one required, you can use the ``--update-plugin`` flag.
fr_fr: Pour migrer les données du plugin, utilisez la commande ``glpi:migration:domains_plugin_to_core``. La présence du plugin est nécessaire pour permettre certaines vérifications, mais vous pouvez utiliser l'option ``--without-plugin`` pour désactiver celles-ci, même si nous vous le déconseillons. Si vous utilisiez précédemment une ancienne version du plugin, vous pouvez utiliser l'option ``--update-plugin`` pour que le plugin mette ses données à niveau.
ko_kr: 플러그인 데이터를 마이그레이션 하려면, ``glpi:migration:domains_plugin_to_core`` 명령을 사용하세요. 플러그인의 존재여부는 필수이기에 확인이 실행되며, ``--without-plugin`` 스위치를 사용할 수 있지만 이는 권장되지 않습니다. 플러그인의 권장 버전보다 이전 버전을 사용중이라면, ``--update-plugin`` 플래그를 사용할 수 있습니다.

source: At the end, all domains types, domains and item relations will be migrated in core tables.
fr_fr: Après l'opération, tous les types de domaines, les domaines, ainsi que les relations avec d'autres objets auront été migrés dans les tables du cœur de GLPI.
ko_kr: 마지막에, 모든 도메인 유형, 도메인과 아이템 관계들이 코어 테이블로 마이그레이션 됩니다.

source: Migrate Racks plugin
fr_fr: Migration du plugin Racks
ko_kr: 랙 플러그인 마이그레이션

source: Since GLPI 9.3.0, data center infrastructure management is available as a core feature. A migration script from Racks plugin was provided inside the ``scripts`` directory. Since GLPI 9.5.0, this migration script has been refactored and moved inside the CLI console.
fr_fr: Depuis GLPI 9.3.0, la gestion d'infrastructure des centres de données est disponible au sein des fonctionnalités du cœur de GLPI. Un script de migration des données du plugin a été fourni dans le dossier ``scripts``. Depuis GLPI 9.5.0, cette migration a été revue et a été déplacée au sein de la console de commandes.
ko_kr: GLPI 9.3.0 부터, 데이터 센터 인프라 관리가 핵심 기능으로 사용가능 합니다. 랙 플러그인에서의 마이그레이션 스크립트는 ``scripts`` 디렉토리 안에 제공됩니다. GLPI 9.5.0 부터는, 이 마이그레이션 스크립트는 리팩토링되어 CLI 콘솔 내부로 이동되었습니다.

source: To migrate your plugin data; use the ``glpi:migration:racks_plugin_to_core`` command. Presence of the plugin is mandatory so checks can be run, you can use the ``--without-plugin`` switch but this is not recommended. If you were using an older version of the plugin than the one required, you can use the ``--update-plugin`` flag.
fr_fr: Pour migrer les données du plugin, utilisez la commande ``glpi:migration:racks_plugin_to_core``. La présence du plugin est nécessaire pour permettre certaines vérifications, mais vous pouvez utiliser l'option ``--without-plugin`` pour désactiver celles-ci, même si nous vous le déconseillons. Si vous utilisiez précédemment une ancienne version du plugin, vous pouvez utiliser l'option ``--update-plugin`` pour que le plugin mette ses données à niveau.
ko_kr: 플러그인 데이터를 마이그레이션 하려면, ``glpi:migration:racks_plugin_to_core`` 를 사용하세요. 플러그인의 존재여부는 필수이기에 확인이 실행되며, ``--without-plugin`` 스위치를 사용할 수 있지만 이는 권장되지 않습니다. 플러그인의 권장 버전보다 이전 버전을 사용중이라면, ``--update-plugin`` 플래그를 사용할 수 있습니다.
