Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/command-line.po
Languages: fr_fr, ko_kr

source: Command line tools
fr_fr: Outils en ligne de commande
ko_kr: 명령줄 도구

source: Since GLPI 9.2.2, command line tools are provided as supported scripts and are available from the ``scripts`` directory of the archive. On previous versions, those scripts were present in the ``tools`` directory that is not official and therefore not in the release archive.
fr_fr: Depuis GLPI 9.2.2, des outils en ligne de commande sont fournis et disponibles dans le dossier ``script`` de l'archive. Sur les versions précédentes, ces outils étaient présents dans le dossier ``tools`` qui n'est pas officiel et donc non fourni dans l'archive de release.
ko_kr: GLPI 9.2.2 부터, 명령줄 도구는 지원되는 스크립트로 제공되며 아카이브의 ``scripts`` 디렉토리에서 사용가능합니다. 이전 버전에서는, 그 스크립트들이 비공식적으로 ``tools`` 디렉토리에 존재했기에 공개한 아카이브에는 없습니다.

source: Since GLPI 9.4.0, command line tools are being centralized in a console application (``bin/console``). Calling ``php bin/console`` from GLPI directory displays the list of available commands.
fr_fr: Depuis GLPI 9.4.0, les outils en ligne de commande sont centralisés dans une application console (``bin/console``). L'appel à ``php bin/console`` depuis le dossier de GLPI affiche la liste des commandes disponibles.
ko_kr: GLPI 9.4.0 부터, 명령줄 도구는 콘솔 어플리케이션(``bin/console``)에 집중화 되었습니다. GLPI 디렉토리에서 ``php bin/console``를 호출하면 사용가능한 명령 목록을 표시합니다.

source: If APCu is installed on your system, it may fail from command line since default configuration disables it from command-line. To change that, set ``apc.enable_cli`` to ``on`` in your APCu configuration file.
fr_fr: Si APCu est installé sur votre système, il se peut qu'il provoque des échecs en ligne de commande puisque sa configuration par défaut le désactive pour la ligne de commande. Pour changer cela, définissez ``apc.enable_cli`` à ``on`` dans votre fichier de configuration APCu;
ko_kr: APCu를 시스템에 설치하면, 기본 구성으로 인해 명령줄이 비활성되므로 명령줄이 실패할 수도 있습니다. 변경하려면, APCu 구성 파일의 ``apc.enable_cli``를 ``on``으로 설정하세요.

source: When using cli tools, please check the system user you are currently logged in with, and permissions on files and directories. With a wrong user, logs, cache and other files may be created with rights that would not allow your webserver to read or write on thos files!
fr_fr: Lors de l'utilisation des outils en ligne de commande, pensez à vérifier l'utilisateur avec lequel vous êtes actuellement connecté, ainsi que les permissions sur les fichiers et dossiers. Avec un mauvais utilisateur, les fichiers de journalisation, de cache, ou d'autres fichiers, pourraient être créés avec des droits qui ne permettraient pas à votre serveur web d'y accéder en lecture ou écriture.
ko_kr: 명령줄 도구 사용시, 현재 로그인된 시스템 사용자와, 파일과 디렉토리들의 권한을 확인하세요. 그 파일들에 대해 웹서버가 읽거나 쓸 수 없게되는 권한으로 잘못된 사용자, 로그, 캐시 및 그 외 파일들이 생성될 수 있습니다!

source: Console options
fr_fr: Options de la console
ko_kr: 콘솔 선택사항

source: For every console command, following options are available:
fr_fr: Pour l'ensemble des commandes console, les options suivantes sont disponibles :
ko_kr: 모든 콘솔 입력에, 다음 선택사항들이 사용가능합니다:

source: ``--config-dir=CONFIG-DIR`` path of configuration directory to use, relative to current working directory (required only if a custom path is used)
fr_fr: ``--config-dir=CONFIG-DIR`` chemin vers le dossier de configuration à utiliser, relatif au chemin courant (requis seulement si un chemin personnalisé est utilisé)
ko_kr: ``--config-dir=CONFIG-DIR`` 현재 작업중인 디렉토리와 관련된, 사용할 구성 디렉토리의 경로 (사용자 정의 경로 사용시에만 필요)

source: ``-h``, ``--help`` displays command help
fr_fr: ``-h``, ``--help`` affiche la commande d'aide
ko_kr: ``-h``, ``--help`` 명령 도움말 표시

source: ``--lang=LANG`` output language code (default value is existing GLPI "language" configuration or "en_GB")
fr_fr: ``--lang=LANG`` langue utilisée pour la sortie (la valeur par défaut est celle configurée dans GLPI, ou "en_GB")
ko_kr: ``--lang=LANG`` 출력 언어 코드 (기본 값은 GLPI "언어" 구성에 존재하거나 "en_GB")

source: ``-n``, ``--no-interaction`` disable command interactive questions
fr_fr: ``-n``, ``--no-interaction`` désactive les questions interactives
ko_kr: ``-n``, ``--no-interaction`` 명령 대화형 질문 비활성화

source: ``--no-plugins`` disable GLPI plugins during command execution
fr_fr: ``--no-plugins`` désactive les plugins de GLPI pendant l'exécution de la commande
ko_kr: ``--no-plugins`` 명령 실행 중 GLPI 플러그인 비활성화

source: ``-q``, ``--quiet`` disable command output
fr_fr: ``-q``, ``--quiet`` désactive la sortie de la commande
ko_kr: ``-q``, ``--quiet`` 명령 출력 비활성화

source: ``-v|vv|vvv``, ``--verbose=VERBOSE`` verbosity level: 1 for normal output, 2 for more verbose output and 3 for debug
fr_fr: ``-v|vv|vvv``, ``--verbose=VERBOSE`` niveau de verbosité : 1 pour une sortie normale, 2 pour plus de verbosité, et 3 pour le débogage
ko_kr: ``-v|vv|vvv``, ``--verbose=VERBOSE`` 상세 수준: 1은 일반 출력, 2는 더 상세 출력이며 3은 디버그 용

source: Additional install and update tools
fr_fr: Outils supplémentaires d'installation et mise à jour
ko_kr: 추가 설치 및 도구 갱신

source: Check requirements
fr_fr: Vérification des prérequis
ko_kr: 요구 사항 확인

source: Before installing or upgrading, requirements are automatically checked; but you can run them separately and see state for all of them using the ``glpi:system:check_requirements`` command.
fr_fr: Avant une installation ou une mise à jour, les prérequis sont automatiquement vérifiés; vous pouvez lancer cette vérification séparément et voir le résultat détaillé en utilisant la commande ``glpi:system:check_requirements``.
ko_kr: 설치 및 업그레이드 전에, 요구 사항을 자동으로 확인합니다; 하지만 그것들을 나눠서 실행할 수 있고 ``glpi:system:check_requirements`` 명령을 사용하여 그것들의 모든 상태를 확인할 수 있습니다.

source: Enable/Disable maintenance
fr_fr: Activer/Désactiver la maintenance
ko_kr: 유지보수 활성화/비활성화

source: GLPI provides a maintenance mode that can be activated prior to an update, and deactivated after all has been checked.
fr_fr: GLPI fourni un mode maintenance qui peut être activé avant une mise à jour et désactivé une fois celle-ci effectuée et son bon fonctionnement contrôlé.
ko_kr: GLPI는 업데이트 전에 활성화할 수 있는 유지보수 모드를 제공하며, 모든 확인 후에 비활성화 됩니다.

source: Just use the ``glpi:maintenance:enable`` and ``glpi:maintenance:disable`` commands.
fr_fr: Utilisez simplement les commandes ``glpi:maintenance:enable`` et ``glpi:maintenance:disable``.
ko_kr: ``glpi:maintenance:enable`` 와 ``glpi:maintenance:disable`` 을 사용하세요.

source: Install
fr_fr: Installation
ko_kr: 설치

source: The ``php bin/console db:install`` has been made to install GLPI database in CLI mode.
fr_fr: La commande ``php bin/console db:install`` permet l'installation de GLPI en ligne de commande.
ko_kr: ``php bin/console db:install``는 CLI 모드에서 GLPI 데이터베이스 설치를 위해 만들어 졌습니다.

source: Possible options for this command are:
fr_fr: Les options possibles pour cette commande sont :
ko_kr: 이 명령에 가능한 선택사항은:

source: ``-r``, ``--reconfigure`` to enable overriding of any existing DB configuration file
fr_fr: ``-r``, ``--reconfigure`` pour autoriser l'écrasement d'une éventuelle configuration de base de données déjà existante
ko_kr: ``-r``, ``--reconfigure`` 모든 기존 DB 구성 파일의 중첩 활성화

source: ``-f``, ``--force`` to force execution of installation even if database is not empty
fr_fr: ``-f``, ``--force`` pour forcer l'exécution de l'installation même si la base de données n'est pas vide
ko_kr: ``-f``, ``--force`` 데이터베이스가 비어있지 않아도 설치 강제 실행

source: ``-L``, ``--default-language=DEFAULT_LANGUAGE`` default language of GLPI (`en_GB` per default)
fr_fr: ``-L``, ``--default-language=DEFAULT_LANGUAGE`` langue par défaut de GLPI (`en_GB` par défaut)
ko_kr: ``-L``, ``--default-language=DEFAULT_LANGUAGE`` GLPI 의 기본 언어 (기본 `en_GB`)

source: ``-H``, ``--db-host=DB_HOST`` host name (`localhost` per default)
fr_fr: ``-H``, ``--db-host=DB_HOST`` nom d'hôte ou adresse IP (`localhost` par défaut)
ko_kr: ``-H``, ``--db-host=DB_HOST`` 호스트 이름 (`기본으로 localhost`)

source: ``-P``, ``--db-port=DB_PORT`` database port (default MySQL port if option is not defined)
fr_fr: ``-P``, ``--db-port=DB_PORT`` port de la base de données (port par défaut de MySQL si l'option n'est pas définie)
ko_kr: ``-P``, ``--db-port=DB_PORT`` 데이터베이스 포트 (선택사항이 정의되지 않으면 기본 MySQL 포트)

source: ``-d``, ``--db-name=DB_NAME`` database name
fr_fr: ``-d``, ``--db-name=DB_NAME`` nom de la base de données
ko_kr: ``-d``, ``--db-name=DB_NAME`` 데이터베이스 이름

source: ``-u``, ``--db-user=DB_USER`` database user name
fr_fr: ``-u``, ``--db-user=DB_USER`` nom d'utilisateur de la base de données
ko_kr: ``-u``, ``--db-user=DB_USER`` 데이터베이스 사용자 이름

source: ``-p``, ``--db-password=DB_PASSWORD`` database user's pasword (use it without value to be prompted for password)
fr_fr: ``-p``, ``--db-password=DB_PASSWORD`` mot de passe pour l'utilisateur de la base de données (utiliser sans valeur pour être invité à saisir le mot de passe)
ko_kr: ``-p``, ``--db-password=DB_PASSWORD`` 데이터베이스 사용자 비밀번호 (비밀번호 묻는 것 없이 사용)

source: If mandatory options are not specified in the command call, the console will ask for them.
fr_fr: Si les options obligatoires ne sont pas spécifiées lors de l'appel à la commande, la console vous invitera à les saisir.
ko_kr: 명령 호출 시 필수 선택사항을 지정하지 않으면, 콘솔에서 그에대해 묻습니다.

source: Database connection parameters may be ommited if a configuration file already exists.
fr_fr: Les paramètres de connexion à la base de données peuvent être omis si un fichier de configuration existe déjà.
ko_kr: 구성 파일이 이미 존재하면 데이터베이스 연결 매개변수는 생략될 수 있습니다.

source: See also :ref:`console options <cdline_options>`.
fr_fr: Voir aussi les :ref:`options de console <cdline_options>`.
ko_kr: 또한 :ref:`console options <cdline_options>`도 참고하세요.

source: Database connection configuration
fr_fr: Configuration de la connexion à la base de données
ko_kr: 데이터베이스 연결 구성

source: The ``php bin/console db:configure`` has been made to define database connection parameters in CLI mode.
fr_fr: La commande ``php bin/console db:configure`` permet de définir les paramètres de connexion à la base de données en ligne de commande.
ko_kr: ``php bin/console db:configure``는 CLI 모드에서 데이터베이스 연결 매개변수 정의를 위해 만들어 졌습니다.

source: Update
fr_fr: Mise à jour
ko_kr: 갱신

source: The ``php bin/console db:update`` has been made to update GLPI database in CLI mode from a previously installed version.
fr_fr: La commande ``php bin/console db:update`` permet de mettre à jour GLPI, depuis une précédente version, en ligne de commande.
ko_kr: ``php bin/console db:update``는 이전에 설치된 버전에서의 CLI 모드에서 GLPI 데이터베이스 업데이트를 위해 만들어 졌습니다.

source: There is no required arguments, just run the command so it updates your database automatically.
fr_fr: Il n'y a pas d'arguments requis. Lancez simplement la commande pour procéder à la mise à jour de la base de données.
ko_kr: 필요한 인수는 없고, 명령을 실행하면 자동으로 데이터베이스를 업데이트 합니다.

source: Do not forget to backup your database before any update try!
fr_fr: Ne pas oublier d'effectuer une sauvegarde de la base de données avant toute tentative de mise à jour !
ko_kr: 업데이트 시도 전에 데이터베이스 백업을 잊지마세요!

source: ``-u``, ``--allow-unstable`` allow update to an unstable version (use it with cautions)
fr_fr: ``-u``, ``--allow-unstable`` autorise la mise à jour vers une version instable (à utiliser avec précaution)
ko_kr: ``-u``, ``--allow-unstable`` 는 (경고와 함께 사용하는) 비안정화 버전의 업데이트를 허용합니다

source: ``-f``, ``--force`` force execution of update from v-1 version of GLPI even if schema did not changed
fr_fr: ``-f``, ``--force`` force l'exécution de la mise à jour depuis la version v-1, même si la base de données semble déjà être à jour
ko_kr: ``-f``, ``--force``는 스키마가 변경되지 않아도 GLPI의 v-1 버전에서의 업데이트를 강제 실행합니다

source: Security key
fr_fr: Clé de sécurité
ko_kr: 보안 키

source: GLPI key file is available for GLPI >= 9.4.6 but is not mandatory. As of GLPI 9.5, using the key file will be mandatory.
fr_fr: Le fichier de clé de GLPI est disponible pour GLPI >= 9.4.6 mais n'est pas obligatoire. À partir de GLPI 9.5, utilisé un fichier de clé sera obligatoire.
ko_kr: GLPI 키 파일은 GLPI >= 9.4.6에서 사용가능하지만 필수는 아닙니다. GLPI 9.5부터는, 키 파일 사용이 필수가 되었습니다.

source: In order to store some sensitive data, GLPI relies on a homemade encryption/decryption tool, which uses a key to:
fr_fr: Dans le but de stocker certains contenus sensibles, GLPI se base sur un outil fait maison de chiffrement/déchiffrement, qui utilise une clé pour :
ko_kr: 일부 중요한 데이터를 저장하기위해, GLPI는 다음의 키를 사용하는, 직접 만든 암호화/복호화 도구를 사용합니다:

source: encrypt data before storing them in the database,
fr_fr: chiffrer les données avant de les stocker en base de données,
ko_kr: 데이터베이스에 저장하기 전 데이터 암호화,

source: decrypt data that has been retrieved from the database.
fr_fr: déchiffrer les données qui ont été récupérées en base de données.
ko_kr: 데이터베이스에서 가져온 데이터 복호화.

source: The ``php bin/console glpi:security:change_key`` command allows to change the key, if it has been compromised for example. By default, command will:
fr_fr: La commande ``php bin/console glpi:security:change_key`` permet de changer la clé, par exemple si elle a été compromise. Par défaut, la commande va :
ko_kr: ``php bin/console glpi:security:change_key`` 명령은 키가 손상된 경우, 변경할 수 있게 합니다. 기본으로, 명령은 다음과 같습니다:

source: generate a new key and and store it in the key file,
fr_fr: générer une nouvelle clé et la stocker dans le fichier de clé,
ko_kr: 새 키를 생성하여 키 파일에 저장하고,

source: update all configured fields (for core and compatible plugins) to use the new key,
fr_fr: mettre à jour tous les champs configurés (pour le cœur et les plugins), afin d'utiliser la nouvelle clé,
ko_kr: 새 키 사용을 위한 모든 구성 항목 (코어와 호환되는 플러그인들) 을 갱신하며,

source: update all configuration entries listed (for core and compatible plugins) to use the new key.
fr_fr: mettre à jour tous les éléments de configuration listés (pour le cœur et les plugins), afin d'utiliser la nouvelle clé,
ko_kr: 새 키 사용을 위해 나열된 모든 구성 항목들 (코어와 호환되는 플러그인들) 을 갱신합니다.

source: Various tools
fr_fr: Autres outils
ko_kr: 여러 도구

source: Database schema check
fr_fr: Vérification du schéma de base de données
ko_kr: 데이터베이스 스키마 확인

source: The ``php bin/console db:check`` command can be used to check if your database schema differs from expected one.
fr_fr: La commande ``php bin/console db:check`` permet de vérifier si le schéma de base de données diffère de celui escompté.
ko_kr: ``php bin/console db:check`` 명령은 데이터베이스 스키마가 예상되는 것과의 차이점을 확인할 수 있게 합니다.

source: If you have any diff, output will looks like :
fr_fr: Si vous avez une quelconque différence, la sortie ressemblera à ceci :
ko_kr: 차이점이 있다면, 출력은 다음과 같을 것입니다 :

source: LDAP synchonization
fr_fr: Synchronisation LDAP
ko_kr: LDAP 동기화

source: The ``bin/console glpi:ldap:synchronize_users`` command can be used to synchronize users against LDAP server informations.
fr_fr: La commande ``bin/console glpi:ldap:synchronize_users`` permet de synchroniser les utilisateurs de GLPI sur la base des informations d'un serveur LDAP.
ko_kr: ``bin/console glpi:ldap:synchronize_users`` 명령은 LDAP 서버 정보에 대한 사용자 동기화를 사용할 수 있게 합니다.

source: ``-c``, ``--only-create-new`` only create new users
fr_fr: ``-c``, ``--only-create-new`` créer seulement les nouveaux utilisateurs
ko_kr: ``-c``, ``--only-create-new`` 새 사용자 생성 전용

source: ``-u``, ``--only-update-existing`` only update existing users
fr_fr: ``-u``, ``--only-update-existing`` met à jour seulement les utilisateurs déjà existants
ko_kr: ``-u``, ``--only-update-existing`` 기존 유저 갱신 전용

source: ``-s``, ``--ldap-server-id[=LDAP-SERVER-ID]`` synchronize only users attached to this LDAP server (multiple values allowed)
fr_fr: ``-s``, ``--ldap-server-id[=LDAP-SERVER-ID]`` ne synchronise que les informations associées au serveur LDAP désigné (plusieurs valeurs possibles)
ko_kr: ``-s``, ``--ldap-server-id[=LDAP-SERVER-ID]`` 이 LDAP 서버에 연결된 사용자 만 동기화 (복수 값 허용함)

source: ``-f``, ``--ldap-filter[=LDAP-FILTER]`` filter to apply on LDAP search
fr_fr: ``-f``, ``--ldap-filter[=LDAP-FILTER]`` filtre à appliquer lors de la recherche LDAP
ko_kr: ``-f``, ``--ldap-filter[=LDAP-FILTER]`` LDAP 검색에 적용할 필터

source: ``--begin-date[=BEGIN-DATE]`` begin date to apply in "modifyTimestamp" filter
fr_fr: ``--begin-date[=BEGIN-DATE]`` date de début à appliquer dans le filtre "modifyTimestamp"
ko_kr: ``--begin-date[=BEGIN-DATE]`` "modifyTimestamp" 필터 내에 적용할 시작 일자

source: ``--end-date[=END-DATE]`` end date to apply in "modifyTimestamp" filter
fr_fr: ``--end-date[=END-DATE]`` date de fin à appliquer dans le filtre "modifyTimestamp"
ko_kr: ``--end-date[=END-DATE]`` "modifyTimestamp" 필터 내에 적용할 종료 일자

source: ``-d``, ``--deleted-user-strategy[=DELETED-USER-STRATEGY]`` force strategy used for deleted users:
fr_fr: ``-d``, ``--deleted-user-strategy[=DELETED-USER-STRATEGY]`` force la stratégie utilisée pour les utilisateurs supprimés :
ko_kr: ``-d``, ``--deleted-user-strategy[=DELETED-USER-STRATEGY]`` 삭제된 사용자에 대해 강제 정책 사용됨:

source: 0: Preserve
fr_fr: 0: Préserver
ko_kr: 0: 보존

source: 1: Put in trashbin
fr_fr: 1: Mettre dans la corbeille
ko_kr: 1: 휴지통에 버리기

source: 2: Withdraw dynamic authorizations and groups
fr_fr: 2: Retirer des autorisations et des groupes dynamiques
ko_kr: 2: 동적 인증과 그룹 취소

source: 3: Disable
fr_fr: 3: Désactiver
ko_kr: 3: 비활성화

source: 4: Disable + Withdraw dynamic authorizations and groups
fr_fr: 4: Désactiver + Retirer des autorisations et des groupes dynamiques
ko_kr: 4: 비활성화 + 동적 인증과 그룹 취소

source: See http://php.net/manual/en/datetime.formats.php for supported date formats in ``--begin-date`` and ``--end-date`` options.
fr_fr: Voir https://www.php.net/manual/fr/datetime.formats.php pour les formats de date supportés dans les options ``--begin-date`` et ``--end-date``.
ko_kr: ``--begin-date`` 과 ``--end-date`` 선택사항에 지원되는 날짜 형식은 http://php.net/manual/en/datetime.formats.php를 참고하세요.

source: Task unlock
fr_fr: Déverrouillage des tâches
ko_kr: 작업 잠금해제

source: The ``php bin/console task:unlock`` command can be used to unlock stucked cron tasks.
fr_fr: La commande ``php bin/console task:unlock`` peut être utilisée pour déverrouiller les tâche planifiées bloquées.
ko_kr: ``php bin/console task:unlock`` 명령은 잠긴 반복 작업의 해제를 할 수 있게 합니다.

source: Keep in mind that no task should be stucked except in case of a bug or a system failure (database failure during cron execution for example).
fr_fr: Gardez à l'esprit qu'aucune tâche ne devrait rester bloquée, sauf de la cas d'un bug ou d'une défaillance système (une défaillance de base de données pendant l'exécution d'une tâche par exemple).
ko_kr: 버그나 시스템 오류 (예를들면 반복 실행 중의 데이터베이스 오류) 의 경우를 제외하고는 잠기는 작업이 없어야 함을 명심하세요.

source: ``-a``, ``--all`` unlock all tasks
fr_fr: ``-a``, ``--all`` déverrouiller toutes les tâches
ko_kr: ``-a``, ``--all`` 모든 작업 잠금해제

source: ``-c``, ``--cycle[=CYCLE]`` execution time (in cycles) from which the task is considered as stuck (delay = task frequency * cycle)
fr_fr: ``-c``, ``--cycle[=CYCLE]`` temps d'exécution (en cycles) à partir duquel une tâche est considérée comme bloquée (délai = fréquence d'exécution de la tâche * cycle)
ko_kr: ``-c '',``--cycle [= CYCLE]`` 작업이 잠긴 것으로 간주되는 실행 시간 (주기) (지연 = 작업 빈도 * 주기)

source: ``-d``, ``--delay[=DELAY]`` execution time (in seconds) from which the task is considered as stuck (default: 1800)
fr_fr: ``-d``, ``--delay[=DELAY]`` temps d'exécution (en secondes) à partir duquel une tâche est considérée comme bloquée (1800 secondes par défaut)
ko_kr: ``-d``, ``--delay[=DELAY]`` 작업이 잠긴 것으로 간주되는 실행 시간 (초) (기본값 : 1800)

source: ``-t``, ``--task[=TASK]`` ``itemtype::name`` of task to unlock (e.g: ``MailCollector::mailgate``)
fr_fr: ``-t``, ``--task[=TASK]`` ``itemtype::name`` de la tâche à débloquer (par exemple : ``MailCollector::mailgate``)
ko_kr: 잠금 해제할 작업의 ``-t``, ``--task[=TASK]`` ``itemtype::name`` (예 :``MailCollector::mailgate``)

source: Plugins tools
fr_fr: Outils pour les plugins
ko_kr: 플러그인 도구

source: Some command line tolls are also available to manage plugins from command line:
fr_fr: Certains commandes sont aussi disponibles pour gérer les plugins en ligne de commande :
ko_kr: 또한 명령줄에서 플러그인 관리를 위해서 몇가지 명령줄 도구들을 사용할 수 있습니다:

source: In order to install ``MyGreatPlugin``; you should end with something like:
fr_fr: Pour installer le plugin ``MyGreatPlugin``; vous devriez effectuer ceci :
ko_kr: ``MyGreatPlugin``을 설치하려면; 몇가지를 마쳐야 합니다:

source: Each of those plugin commands can take a plugin name as argument, or the ``--all`` flag to be ran on all plugins.
fr_fr: Chacune de ces commandes peut prendre comme argument le nom d'un plugin, ou l'option ``--all`` si vous souhaitez la lancer pour tous les plugins.
ko_kr: 각각의 플러그인 명령은 인수로써 플러그인 이름을 갖거나, 모든 플러그인 실행을 위한 ``--all`` 플래그를 가질 수 있습니다.

source: Migration tools
fr_fr: Outils de migration
ko_kr: 마이그레이션 도구

source: From MyISAM to InnoDB
fr_fr: De MyISAM à InnoDB
ko_kr: MyISAM 에서 InnoDB로

source: Since version 9.3.0, GLPI uses the ``InnoDB`` engine instead of previously used ``MyISAM`` engine.
fr_fr: Depuis la version 9.3.0, GLPI utilise le moteur ``InnoDB`` en remplacement du moteur ``MyISAM`` précédemment utilisé.
ko_kr: 9.3.0, GLPI 버전부터, 이전에 사용된 ``MyISAM`` 엔진 대신 ``InnoDB`` 엔진을 사용합니다.

source: The ``php bin/console glpi:migration:myisam_to_innodb`` command can be used to migrate exiting tables to ``InnoDB`` engine.
fr_fr: La commande ``php bin/console glpi:migration:myisam_to_innodb`` peut être utilisée pour migrer les tables ewistantes vers le moteur ``InnoDB``.
ko_kr: ``php bin/console glpi:migration:myisam_to_innodb`` 명령은 기존 테이블을 ``InnoDB`` 엔진으로 마이그레이션 할 수 있게 합니다.

source: Missing timestamps builder
fr_fr: Récupération des horodatages manquants
ko_kr: 타임스탬프 빌더 누락

source: Prior to GLPI 9.1.0, fields corresponding to creation and modification dates were not existing.
fr_fr: Avant GLPI 9.1.0, les champs correspondant aux dates de création et de modification n'existaient pas.
ko_kr: GLPI 9.1.0 이전에는, 생성 및 수정 일자에 해당하는 항목이 존재하지 않았습니다.

source: The ``php bin/console glpi:migration:build_missing_timestamps`` command can be used to rebuild missing values using available logs.
fr_fr: La commande ``php bin/console glpi:migration:build_missing_timestamps`` peut être utilisée pour reconstruire les valeurs manquantes en utilisant les données de journalisation.
ko_kr: ``php bin/console glpi:migration:build_missing_timestamps`` 명령은 사용가능한 로그들을 사용하여 누락된 값들을 재구축 할 수 있게 합니다.

source: Use timestamp data type
fr_fr: Utilisation du type de données timestamp
ko_kr: 타임스탬프 데이터 유형 사용

source: Many date fields were using the ``DATETIME`` type, but this does not allow to rely on timezones. Timezone support requires all fields to use ``TIMESTAMP`` data type, but this query can be very long and therefore is not included in the standard update process.
fr_fr: De nombreux champs de date utilisaient le type de données ``DATETIME``, mais celui-ci ne permet pas un usage des fuseaux horaires. Le support de ces fuseaux nécessite que tous les champs utilisent le type de données ``TIMESTAMP``, mais la requête de mise à jour peut s'avérer très longue à exécuter et n'est donc pas inclue dans le processus de mise à jour standard.
ko_kr: 많은 일자 항목들은 ``DATETIME`` 유형을 사용하지만, 이는 표준시간대에 의존하게 하지 않습니다. 표준시간대 지원은 모든 항목들에 ``TIMESTAMP`` 자료 유형을 사용해야하지만, 이 질의어는 매우 길 수 있기에 표준 업데이트 진행에 포함되지 않습니다.

source: Using the ``glpi:migration:timestamps`` command will change those fields to the correct data type, but read :doc:`documentation on timezones <timezones>` before.
fr_fr: Utiliser la commande ``glpi:migration:timestamps`` changera ces champs pour qu'ils utilisent le bon type de données, mais pensez à lire la :doc:`documentation relative aux fuseaux horaires <timezones>` avant d'effectuer la migration.
ko_kr: ``glpi:migration:timestamps`` 명령을 사용하면 그 항목들이 올바른 자료 유형으로 변경되게 되지만, 먼저 :doc:`documentation on timezones <timezones>` 를 읽어보세요.

source: Ensure to backup your database before!
fr_fr: Assurez vous de faire une sauvegarde de votre base données avant l'opération!
ko_kr: 먼저 데이터베이스를 백업했는지 확인하세요!

source: Migrate Domains plugin
fr_fr: Migration du plugin Domaines
ko_kr: 도메인 플러그인 마이그레이션
