Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/prerequisites.po
Languages: cs_cz, de_de, pt_br, zh_cn

source: Prerequisites
cs_cz: Technické náležitosti
de_de: Voraussetzungen
pt_br: Pré-requisitos
zh_cn: 要求

source: GLPI is a Web application that will need:
cs_cz: GLPI je webová aplikace, která bude potřebovat:
de_de: GLPI ist eine Webanwendung, die folgendes benötigt:
pt_br: GLPI é um aplicativo da Web que precisará:
zh_cn: GLPI 是一款Web应用程序它需要:

source: a webserver;
cs_cz: webový server;
de_de: einen Webserver
pt_br: um servidor web;
zh_cn: web服务器;

source: PHP;
cs_cz: interpret PHP;

source: a database.
cs_cz: databázi.
de_de: eine Datenbank.
pt_br: um banco de dados.
zh_cn: 一个数据库.

source: Web server
cs_cz: Webový server
pt_br: Servidor Web
zh_cn: Web 服务器

source: GLPI requires a web server that supports PHP, like:
cs_cz: GLPI potřebuje webový server který spolupracuje s PHP, jako například:
de_de: GLPI benötigt einen Webserver, der PHP unterstützt, wie z.B.:
pt_br: GLPI requer um servidor web que ofereça suporte a PHP, como:
zh_cn: GLPI 要求Web服务器能支持 PHP, 例如:

source: `Apache 2 (or more recent) <http://httpd.apache.org>`_;
cs_cz: `Apache 2 (nebo novější) <http://httpd.apache.org>`_;
de_de: `Apache 2 (oder aktueller) <http://httpd.apache.org>`_;
pt_br: `Apache 2 (ou mais recente) <http://httpd.apache.org>`_;
zh_cn: `Apache 2 (或更新版) <http://httpd.apache.org>`_;

source: PHP
cs_cz: Interpret PHP

source: Mandatory extensions
cs_cz: Nezbytná rozšíření
de_de: Notwendige Erweiterungen
pt_br: Extensões obrigatórias
zh_cn: 必备扩展依赖

source: Following PHP extensions are required for the app to work properly:
cs_cz: Aby aplikace fungovala správně, jsou potřebná následující rozšíření pro PHP:
de_de: Folgende PHP-Erweiterungen werden für die Anwendung benötigt:
pt_br: As seguintes extensões PHP são necessárias para que o aplicativo funcione corretamente:
zh_cn: 应用需要以下PHP扩展才能正常工作:

source: ``curl``: for CAS authentication, GLPI version check, Telemetry, ...;
cs_cz: ``curl``: pro CAS ověřování, kontrolu verze GLPI, telemetrii, …;
de_de: ``curl``: für CAS Authentifizierung, GLPI-Versionsprüfung, Telemetry, ...;
pt_br: ``curl``: para autenticação CAS, verificação de versão do GLPI, Telemetria, etc;
zh_cn: ``curl``: 用于 CAS 认证, GLPI 版本检查, 遥测技术, ...;

source: ``fileinfo``: to get extra informations on files;
cs_cz: ``fileinfo``: pro získávání dalších informací o souborech;
de_de: ``fileinfo``: für zusätzliche Dateiinformationen;
pt_br: ``fileinfo``: para obter informações extras dos arquivos;
zh_cn: ``fileinfo``: 获取文件的扩展信息;

source: ``gd``: to generate images;
cs_cz: ``gd``: pro vytváření obrázků;
de_de: ``gd``: zum Erstellen von Bildern;
pt_br: ``gd``: para gerar imagens;
zh_cn: ``gd``: 用于生成图片;

source: ``json``: to get support for JSON data format;
cs_cz: ``json``: pro podporu datového formátu JSON;
de_de: ``json``: zur Verwendung von JSON;
pt_br: ``json``: para obter suporte para o formato de dados JSON;
zh_cn: ``json``: 用于支持 JSON 数据格式;

source: ``mbstring``: to manage multi bytes characters;
cs_cz: ``mbstring``: pro správu vícebajtových znaků;
de_de: ``mbstring``: zur Verwaltung von Multi-Byte-Zeichen;
pt_br: ``mbstring``: gerenciar caracteres multibytes;
zh_cn: ``mbstring``: 管理多字节字符;

source: ``mysqli``: to connect and query the database;
cs_cz: ``mysqli``: pro připojení do a dotazování databáze;
de_de: ``mysqli``: zur Verbindung und Abfrage der Datenbank;
pt_br: ``mysqli``: para conectar e consultar o banco de dados;
zh_cn: ``mysqli``: 连接和查询数据库。;

source: ``session``: to get user sessions support;
cs_cz: ``session``: pro podporu uživatelských sezení;
de_de: ``session``: für Session-Support;
pt_br: ``session``: para obter suporte a sessões de usuários;
zh_cn: ``session``: 用于获取用户session会话;

source: ``zlib``: to get backup and restore database functions;
cs_cz: ``zlib``: pro funkci zálohování a obnovu databáze;
de_de: ``zlib``: für Backup- und Wiederherstellungsfunktionen der Datenbank.;
pt_br: ``zlib``: para efetuar backup e restaurar as funções da base de dados;
zh_cn: ``zlib``: 用于数据库的备份与恢复功能;

source: Optional extensions
cs_cz: Volitelná rozšíření
de_de: Optionale Erweiterungen
pt_br: Extensões opcionais
zh_cn: 可选的扩展

source: Even if those extensions are not mandatory, we advise you to install them anyways.
cs_cz: I když tato rozšíření nejsou povinná, je doporučeno je nainstalovat i tak.
de_de: Auch wenn diese Erweiterungen nicht zwingend erforderlich sind, empfehlen wir Ihnen, sie trotzdem zu installieren.
pt_br: Mesmo que essas extensões não sejam obrigatórias, recomendamos que você as instale de qualquer maneira.
zh_cn: 即使这些扩展不是强制性的，我们建议您无论如何都要安装它们。

source: Following PHP extensions are required for some extra features of GLPI:
cs_cz: Pro některé další funkce GLPI jsou potřebná následující rozšíření pro PHP:
de_de: Folgende PHP-Erweiterungen sind für einige zusätzliche Funktionen von GLPI erforderlich:
pt_br: As seguintes extensões PHP são necessárias para alguns recursos extras do GLPI:
zh_cn: 对于GLPI的一些额外特性，需要以下PHP扩展:

source: ``cli``: to use PHP from command line (scripts, automatic actions, and so on);
cs_cz: ``cli``: pro použití PHP z příkazového řádku (scripty, automatické akce, atd);
de_de: ``cli``: zur Verwendung von PHP auf der Kommandozeile (Skripte, Automatisierungen usw.);
pt_br: ``cli``: usar o PHP a partir da linha de comando (scripts, ações automáticas, etc.);
zh_cn: ``cli``: 用于命令行下使用 PHP (脚本, 自动动作, 或更多其他);

source: ``domxml``: used for CAS authentication;
cs_cz: ``domxml``: slouží pro CAS ověřování;
de_de: ``domxml``: für CAS Authentifizierung;
pt_br: ``domxml``: usado para autenticação CAS;
zh_cn: ``domxml``: 用于 CAS 认证;

source: ``imap``: used for mail collector ou user authentication;
cs_cz: ``imap``: slouží pro ověřování uživatelů ou sběru e-mailů;
de_de: ``imap``: für den E-Mail-Kollektor und Nutzer-Authentifizierung;
pt_br: ``imap``: usado para coletar emails ou autenticação de usuário;
zh_cn: ``imap``: 用于邮件收发或用户身份认证;

source: ``ldap``: use LDAP directory for authentication;
cs_cz: ``ldap``: používání LDAP adresáře pro ověřování uživatelů;
de_de: ``ldap``: für eine Authentifizierung via LDAP;
pt_br: ``ldap``: usar o diretório LDAP para autenticação;
zh_cn: ``ldap``: 使用 LDAP 目录来身份认证;

source: ``openssl``: secured communications;
cs_cz: ``openssl``: zabezpečená komunikace;
de_de: ``openssl``: Verschlüsselte Kommunikation;
pt_br: ``openssl``: comunicações seguras;
zh_cn: ``openssl``: 通讯安全需要它;

source: ``xmlrpc``: used for XMLRPC API.
cs_cz: ``xmlrpc``: slouží pro XMLRPC API.
de_de: ``xmlrpc``: benötigt für XMLRPC API.
pt_br: `` xmlrpc``: usado para a API XMLRPC.
zh_cn: ``xmlrpc``: 使用 XMLRPC API.

source: ``APCu``: may be used for cache; among others (see `caching configuration (in french only) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`_.
cs_cz: ``APCu``: krom jiného, může být použito pro mezipaměť (viz `nastavení mezipaměti (pouze ve francouzštině) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`_.
de_de: ``APCu``: kann unter anderem für den Cache verwendet werden (siehe `Cache-Konfiguration (nur auf Französisch) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>``_.
pt_br: `APCu``: pode ser usado para cache; entre outros (veja `configuração de caching (somente em francês) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`
zh_cn: ``APCu``: 可用于高速缓存; 特别地 (参见 `caching configuration (仅法语) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`_.

source: Configuration
cs_cz: Nastavení
de_de: Konfiguration
pt_br: Configuração
zh_cn: 配置

source: PHP configuration file (``php.ini``) must be adapted to reflect following variables:
cs_cz: Je třeba upravit soubor s nastaveními PHP (``php.ini``) aby odpovídal následujícím proměnným:
de_de: Die PHP-Konfigurationsdatei (``php.ini``) muss an die folgenden Variablen angepasst werden:
pt_br: O arquivo de configuração do PHP (``php.ini``) pode ser adaptado para refletir as seguintes variáveis:
zh_cn: PHP 配置文件 (``php.ini``) 必须加以调整，以反映下列变数:

source: Database
cs_cz: Databáze
de_de: Datenbank
pt_br: Banco de dados
zh_cn: 数据库

source: Currently, only `MySQL <https://dev.mysql.com>`_ (5.6 minimum) and `MariaDB <https://mariadb.com>`_ (10.0 minimum) database servers are supported by GLPI.
cs_cz: V tuto chvíli jsou GLPI podporovány databázové servery `MySQL <https://dev.mysql.com>`_ (přinejmenším verze 5.6) a `MariaDB <https://mariadb.com>`_ (přinejmenším verze 10.0).
de_de: Derzeit werden nur `MySQL <https://dev.mysql.com>`_ (mindestens 5.6) und `MariaDB <https://mariadb.com>``_ (mindestens 10.0) Datenbankserver von GLPI unterstützt.
pt_br: Atualmente, apenas os servidores de banco de dados `MySQL <https://dev.mysql.com>` _ (5.6 mínimo) e `MariaDB <https://mariadb.com>` _ (10.0 mínimo) são suportados pelo GLPI.
zh_cn: 当前, GLPI仅支持 `MySQL <https://dev.mysql.com>`_ (5.6 minimum) 以及 `MariaDB <https://mariadb.com>`_ (10.0 minimum) 数据库.

source: In order to work, GLPI requires a database server.
cs_cz: Aby mohlo fungovat, GLPI vyžaduje databázový server.
de_de: Um zu funktionieren, benötigt GLPI einen Datenbankserver.
pt_br: Para funcionar, o GLPI requer um servidor de banco de dados.
zh_cn: 为了工作，GLPI需要一个数据库服务器。

source: We recommend to use the most recent stable PHP release for better performances.
pt_br: Recomendamos o uso da versão estável do PHP mais recente para obter melhores desempenhos.
