Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/timezones.po
Languages: fr_fr, ko_kr, pt_br, ru_ru

source: Timezones
fr_fr: Fuseaux horaires
ko_kr: 표준시간대
pt_br: Fuso Horários
ru_ru: Часовые пояса

source: In order to get timezones working on a MariaDB/MySQL instance, you will have to initialize Timezones data and grant GLPI database user read ACL on their table.
fr_fr: Afin que les fuseaux horaires puissent fonctionner sur une instance MariaDB/MySQL, vous devez initialiser les données des fuseaux horaires, et autoriser donner le droit READ sur leur table à l'utilisateur de la base de données GLPI.
ko_kr: MariaDB/MySQL 인스턴스에서 동작하는 표준시간대 값을 받으려면, 표준시간대 데이터를 초기화하고 GLPI 데이터베이스 사용자가 테이블에서 ACL을 읽도록 허용해야 합니다.
pt_br: Para que os fusos horários funcionem em uma instância do MariaDB/MySQL, você precisará inicializar os dados dos fusos horários e permitir que o usuário do banco de dados GLPI leia a ACL em sua tabela.
ru_ru: Чтобы заставить Часовые пояса работать на экземпляре MariaDB или MySQL, вам придется инициализировать данные часовых поясов и предоставить пользователю базы данных GLPI право чтения в ACL на соответствующую таблицу.

source: Enabling timezone support on your MySQL instance may affect other database in the same instance; be carefull!
fr_fr: Activer le support des fuseaux horaires sur votre instance MySQL peut affecter d'autres bases dans la même instance ; faites attention !
ko_kr: MySQL 인스턴스에서 표준시간대 지원을 활성화하는 것은 같은 인스턴스내의 다른 데이터베이스에 영향을 줄 수 있습니다; 주의하세요!
pt_br: Habilitar o suporte ao fuso horário na sua instância do MySQL pode afetar outro banco de dados na mesma instância; seja cuidadoso!
ru_ru: Будьте осторожны с включение поддержки Часовых поясов в вашем экземпляре MySQL, т.к. это может оказать влияние на данные базы в этом же экземпляре!

source: Currently, MySQL and MariaDB have a maximum date limited to 2038-01-19 on fields relying on ``timestamp`` type!
fr_fr: Actuellement, MySQL et MariaDB ont une date maximum limitée à 2038-01-19 pour les champs utilisant le type ``timestamp`` !
ko_kr: 현재, MySQL과 MariaDB는 ``timestamp`` 유형에 관련된 항목들의 최대 날짜는 2038-01-19 로 제한되어 있습니다!
pt_br: Atualmente, o MySQL e o MariaDB têm uma data máxima limitada a 2038-01-19 em campos que dependem do tipo ``timestamp``!
ru_ru: В настоящее время MySQL и MariaDB имеют максимальную дату, ограниченную 2038-19-01 для полей типа `timestamp`!

source: Non windows users
fr_fr: Utilisateurs non windows
ko_kr: 비 윈도우 사용자
pt_br: Utilizadores não Windows
ru_ru: Пользователи кроме Windows

source: On most systems, you'll have to initialize timezones data from your system's timezones:
fr_fr: Sur la plupart des systèmes, vous devrez initialiser les données des fuseaux horaires depuis ceux du système :
ko_kr: 대부분의 시스템에서, 시스템의 표준시간대에서 표준시간대 데이터를 초기화 해야 합니다:
pt_br: Na maioria dos sistemas, você precisará inicializar os dados dos fusos horários a partir dos fusos horários do sistema:
ru_ru: В большинстве систем вам придется инициализировать данные часовых поясов из часовых поясов вашей системы.

source: You may want to check `MariaDB documentation about mysql_tzinfo_to_sql <https://mariadb.com/kb/en/library/mysql_tzinfo_to_sql/>`_ and your system documentation to know where data are stored (if not in ``/usr/share/zoneinfo``).
fr_fr: Vous pourrez vérifier voir la `documentation de MariaDB à propos de mysql_tzinfo_to_sql <https://mariadb.com/kb/en/library/mysql_tzinfo_to_sql/>`_ ainsi que la documentation de votre système pour savoir où sont stockées les données (si elles ne sont pas dans ``/usr/share/zoneinfo``).
ko_kr: `mysql_tzinfo_to_sql <https://mariadb.com/kb/en/library/mysql_tzinfo_to_sql/>에 대한 MariaDB 문서`_ 와 데이터가 저장된 곳을 알려주는 시스템 문서를 확인하세요 (``/usr/share/zoneinfo` 에 없는 경우).
pt_br: Você pode verificar a documentação do `MariaDB sobre mysql_tzinfo_to_sql <https://mariadb.com/kb/en/library/mysql_tzinfo_to_sql/>`_ e a documentação do sistema para saber onde os dados estão armazenados (se não estiver em ``/usr/share/zoneinfo``).
ru_ru: Возможно, вы захотите свериться с документацией на MariaDB о mysql_tzinfo_to_sql по адресу <https://mariadb.com/kb/en/library/mysql_tzinfo_to_sql/>`, что бы знать где сохранить данные о вашей системной документации (если это будет не в `/usr/share/zoneinfo`).

source: Do not forget to restart the database server once command is successfull.
fr_fr: N'oubliez pas de redémarrer le serveur de base de données une fois que la commande a été exécutée avec succès.
ko_kr: 명령이 실행되면 데이터베이스 서버를 재시작해야 함을 잊지 마세요.
pt_br: Não esqueça de reiniciar o servidor de banco de dados quando o comando for bem-sucedido.
ru_ru: Не забудьте перезапустить сервер базы данных, как только команда будет выполнена успешно.

source: Windows users
fr_fr: Utilisateurs windows
ko_kr: 윈도우 사용자
pt_br: Utilizadores Windows
ru_ru: Пользователи Windows

source: Windows does not provide timezones informations, you'll have to download and intialize data yourself.
fr_fr: Windows ne fournit pas d'informations sur les fuseaux horaires, vous devrez les télécharger et les initialiser vous-même.
ko_kr: 윈도우즈는 표준시간대 정보를 제공하지 않기에, 직접 데이터를 다운로드하고 초기화해야 합니다.
pt_br: O Windows não fornece informações de fuso horário, você precisará baixar e inicializar os dados por conta própria.
ru_ru: Windows не предоставляют информацию о часовых поясах, вам придется скачать и инициализировать данные самостоятельно.

source: See `MariaDB documentation about timezones <https://mariadb.com/kb/en/library/time-zones/#mysql-time-zone-tables>`_.
fr_fr: Consultez la `documentation MariaDB à propos des fuseaux horaires <https://mariadb.com/kb/en/library/time-zones/#mysql-time-zone-tables>`_.
ko_kr: `표준시간대에 대한 MariaDB 문서 <https://mariadb.com/kb/en/library/time-zones/#mysql-time-zone-tables>`_ 를 참고하세요.
pt_br: Consulte a `documentação do MariaDB sobre fusos horários <https://mariadb.com/kb/en/library/time-zones/#mysql-time-zone-tables>`_.
ru_ru: Документацию MariaDB о часовых поясах вы можете посмотреть по адресу <https://mariadb.com/kb/en/library/time-zones/#mysql-time-zone-tables>'_.

source: Grant access
fr_fr: Autoriser l'accès
ko_kr: 접근권한 부여
pt_br: Garantir o acesso
ru_ru: Предоставить доступ

source: Be carefull not to give your GLPI database user too large access. System tables should **never** grant access to app users.
fr_fr: Prêtez attention à ne pas donner d'autorisations trop larges à l'utilisateur de base de données GLPI, les tables système de devraient **jamais** être rendues accessibles aux utilisateurs applicatifs.
ko_kr: GLPI 데이터베이스 사용자에게 너무 큰 접근권한을 부여하지 않도록 조심하세요. 시스템 테이블은 앱 사용자들에게 **절대** 접근권한을 부여하면 안됩니다.
pt_br: Cuidado para não conceder muito acesso ao usuário do banco de dados GLPI. As tabelas do sistema nunca devem conceder acesso aos usuários do aplicativo.
ru_ru: Будьте осторожны с предоставлением слишком широких полномочий пользователям к Системным таблицам. Никогда не предоставляйте доступ к Системным таблицам пользователям приложений.

source: In order to list possible timezones, your GLPI database user must have read access on ``mysql.time_zone_name`` table. Assuming your user is ``glpi@localhost``, you should run something like:
fr_fr: Afin de pouvoir lister les fuseaux horaires disponibles, votre utilisateur base de données GLPI doit avoir un accès en lecture sur la table ``mysql.time_zone_name``. Partant du principe que votre utilisateur est ``glpi@localhost``, vous devriez lancer quelque chose comme :
ko_kr: 사용가능한 표준시간대를 나열하려면, GLPI 데이터베이스 사용자는 ``mysql.time_zone_name`` 테이블에 대한 읽기 권한이 있어야 합니다. 사용자가 ``glpi@localhost``라고 가정한다면, 다음과 같이 실행해야 합니다:
pt_br: Para listar possíveis fusos horários, o usuário do banco de dados GLPI deve ter acesso de leitura na tabela `` mysql.time_zone_name``. Supondo que seu usuário seja ``glpi@localhost``, você deve executar algo como:
ru_ru: Для того чтобы иметь возможность обращаться к Часовым поясам, ваш пользователь базы данных GLPI должен иметь доступ на чтение к таблице `mysql.time_zone_name". Предполагая, что ваш пользователь - "glpi@localhost", вы должны запустить что-то вроде:
