Repository: AntoninGP/doc-install
Catalog: source/locale/*/LC_MESSAGES/update.po
Languages: cs_cz, fr_fr, ko_kr, pt_br

source: Update
cs_cz: Aktualizace
fr_fr: Mise à jour
ko_kr: 업데이트
pt_br: Atualizar

source: As for every update process, you have to backup some data before processing any upgrade:
cs_cz: Jako při každé aktualizaci, je třeba před přechodem na novější verzi zazálohovat některá data:
fr_fr: Comme pour tout processus de mise à jour, une sauvegarde des données doit être effectuée avant toute tentative :
ko_kr: 매번 업데이트 처리마다, 모든 업그레이드 진행 전에 일부 데이터를 백업해야 합니다:
pt_br: A cada processo de atualização, você deve fazer backup dos dados antes de iniciar qualquer atualização:

source: **backup your database**;
cs_cz: **zazálohujte svou databázi**;
fr_fr: **sauvegarde de votre base de données** ;
ko_kr: **데이터베이스를 백업**;
pt_br: ** backup do seu banco de dados **;

source: backup your files directory;
cs_cz: zazálohujte svou složku se soubory;
fr_fr: sauvegarde du dossier ``files`` ;
ko_kr: 파일 디렉토리를 백업;
pt_br: backup do diretório dos arquivos;

source: backup your configuration.
cs_cz: zazálohujte si svá nastavení.
fr_fr: sauvegarde de la configuration.
ko_kr: 구성을 백업
pt_br: backup de sua configuração.

source: First, download latest GLPI version and extract files. GLPI update process is then automated. To start it, just go to your GLPI instance URI, or (recommended) use the :doc:`command line tools <command-line>`.
cs_cz: Nejprve si stáhněte poslední verzi GLPI a rozbalte soubory. Proces update GLPI bude následně atuomatický. Pro jeho spuštění přejděte na adresu vaší GLPI instance nebo (což je doporučeno) použijte :doc:`nástroje příkazové řádky <command-line>`.
fr_fr: Tout d'abord, téléchargez la dernière version de GLPI et extrayez-en les fichiers. La processus de mie à jour de GLPI est automatique. Pour le démarrer , connectez-vous à votre URI GLPI, ou bien, (méthode recommandée), utilisez l' :doc:`outil en ligne de commande<command-line>`.
ko_kr: 먼저, 최신 GLPI 버전을 다운로드하고 파일을 압축해제 하세요. GLPI 업데이트 진행은 자동으로 됩니다. 시작하려면, GLPI 인스턴스 URI로 이동하거나, 또는 (권장됨) :doc:`명령줄 도구 <command-line>`를 사용하세요.
pt_br: Primeiro, baixe a versão mais recente do GLPI e extraia os arquivos. O processo de atualização do GLPI é automatizado. Para iniciá-lo, basta acessar o URI da instância GLPI ou (recomendado) usar as ferramentas de linha de comando :doc:` <command-line>`.

source: Once a new version will be installed; you will not be able to use the application until a migration has been done.
cs_cz: Jakmile bude nová verze nainstalovaná; nebude možné aplikaci používat dokud nebude migrace dokončena.
fr_fr: Une fois la nouvelle version installée, il ne sera plus possible de l'utiliser tant que la migration n'aura pas été effectuée.
ko_kr: 새 버전 설치가 되면; 마이그레이션이 완료되기 전까지 어플리케이션을 사용할 수 없게 됩니다.
pt_br: Uma vez que uma nova versão será instalada; você não poderá usar o aplicativo até que uma migração seja feita.

source: Please also note the update process will automatically disable your plugins.
cs_cz: Mějte na paměti, že proces aktualizace automaticky vypne zásuvné moduly.
fr_fr: Veuillez noter également que le processus de mise à jour désactivera vos plugins.
ko_kr: 또한 업데이트 과정에서는 플러그인들이 자동적으로 비활성화 됨을 명심하세요.
pt_br: Observe também que o processo de atualização desativará automaticamente seus plugins.

source: You should not try to restore a database backup on a non empty database (say, a database that has been partially migrated for any reason).
cs_cz: Neměli byste se pokoušet obnovit zálohu databáze do neprázdné databáze (například databáze, která byla z nějakého důvodu převedena na novější jen z části).
fr_fr: Ne pas essayer de restaurer une sauvegarde sur une base de données non vide (par exemple, une base partiellement migrée pour quelque raison que ce soit).
ko_kr: 비어있지 않은 데이터베이스(즉, 어떤 이유에서든 부분적으로 마이그레이션된 데이터베이스)에서의 데이터베이스 백업 복원을 하지 마세요.
pt_br: Você não deve tentar restaurar um backup de banco de dados em um banco de dados não vazio (por exemplo, um banco de dados parcialmente migrado por qualquer motivo).

source: Make sure your database is empty before restoring your backup and try to update, and repeat on fail.
cs_cz: Před zahájením obnovení ze zálohy ověřte, že je cílová databáze prázdná a pak teprve se pokuste o aktualizaci. V případě nezdaru je třeba opět začít od obnovy do prázdné databáze.
fr_fr: S'assurer que la base est vide avant de restaurer la sauvegarde et tenter de mettre à jour, refaire en cas d'échec.
ko_kr: 백업에서 복원하기 전에 데이터베이스가 비었는지 확인하고 업데이트를 시도하시고, 실패시 반복하세요.
pt_br: Verifique se o banco de dados está vazio antes de restaurar o backup e tente atualizar, e repita o processo caso ocorra alguma falha.
